
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>序言 · 程序设计语言 实践之路（第四版）</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Michael L. Scott">
        <meta name="identifier" content="978-0-12-410409-9" scheme="ISBN">
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="preface.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="part1/">
            
                <a href="part1/">
            
                    
                    第1部分 基础
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="part1/ch1/">
            
                <a href="part1/ch1/">
            
                    
                    第1章 绪论
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1.1" data-path="part1/ch1/1-1.html">
            
                <a href="part1/ch1/1-1.html">
            
                    
                    1.1 程序设计语言设计的艺术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.2" data-path="part1/ch1/1-2.html">
            
                <a href="part1/ch1/1-2.html">
            
                    
                    1.2 程序设计语言族谱
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.3" data-path="part1/ch1/1-3.html">
            
                <a href="part1/ch1/1-3.html">
            
                    
                    1.3 为什么学习程序设计语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.4" data-path="part1/ch1/1-4.html">
            
                <a href="part1/ch1/1-4.html">
            
                    
                    1.4 编译器和解释器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.5" data-path="part1/ch1/1-5.html">
            
                <a href="part1/ch1/1-5.html">
            
                    
                    1.5 编程环境
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >序言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5E8F;&#x8A00;">&#x5E8F;&#x8A00;</h1>
<p>&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x662F;&#x6BCF;&#x4E00;&#x4F4D;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;&#x5FC5;&#x987B;&#x638C;&#x63E1;&#x7684;&#x6838;&#x5FC3;&#x6280;&#x672F;&#x4E4B;&#x4E00;&#xFF0C;&#x80CC;&#x540E;&#x7684;&#x539F;&#x56E0;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x56E0;&#x4E3A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x662F;&#x6211;&#x4EEC;&#x7528;&#x6765;&#x5F00;&#x53D1;&#x4EA7;&#x54C1;&#x548C;&#x4EA4;&#x6D41;&#x65B0;&#x60F3;&#x6CD5;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x5F0F;&#x3002;&#x6570;&#x767E;&#x4E07;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x6784;&#x9020;&#x4E86;&#x4FE1;&#x606F;&#x65F6;&#x4EE3;&#xFF0C;&#x5F71;&#x54CD;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x9886;&#x57DF;&#x3002;&#x7A0B;&#x5E8F;&#x7684;&#x6210;&#x529F;&#x5F52;&#x529F;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x754C;&#x5728;&#x521B;&#x9020;&#x548C;&#x5B9E;&#x73B0;&#x65B0;&#x8BED;&#x8A00;&#x65B9;&#x9762;&#x7684;&#x957F;&#x671F;&#x52AA;&#x529B;&#x3002;Michael Scott&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x811A;&#x6CE8;&#x548C;&#x53C2;&#x8003;&#x6587;&#x732E;&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#x5927;&#x91CF;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;&#xFF0C;&#x8FD9;&#x6E05;&#x695A;&#x5730;&#x8868;&#x660E;&#x4E86;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x7684;&#x89C4;&#x6A21;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x6240;&#x5305;&#x542B;&#x7684;&#x4E3B;&#x9898;&#x7684;&#x591A;&#x6837;&#x6027;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x8BA8;&#x8BBA;&#x4E86;75&#x79CD;&#x4EE5;&#x4E0A;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#xFF0C;&#x65E0;&#x8BBA;&#x5728;&#x65F6;&#x95F4;&#x4E0A;&#x3001;&#x8303;&#x5F0F;&#x4E2D;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9886;&#x57DF;&#x5185;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x4E2D;&#x6700;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x4EE3;&#x8868;&#xFF0C;&#x662F;&#x51E0;&#x5341;&#x5E74;&#x5DE5;&#x4F5C;&#x7684;&#x7ED3;&#x6676;&#xFF1A;&#x6700;&#x521D;&#x5728;20&#x4E16;&#x7EAA;50&#x5E74;&#x4EE3;&#x4EA7;&#x751F;&#x4E86;Fortran&#x548C;Lisp&#xFF0C;&#x968F;&#x540E;&#x4EA7;&#x751F;&#x4E86;&#x8BB8;&#x591A;&#x8BED;&#x8A00;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#xFF0C;&#x8FD8;&#x4EA7;&#x751F;&#x4E86;&#x7528;&#x4E8E;Web&#x7F16;&#x7A0B;&#x7684;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x3002;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x5305;&#x542B;&#x547D;&#x4EE4;&#x5F0F;&#x3001;&#x51FD;&#x6570;&#x5F0F;&#x3001;&#x903B;&#x8F91;&#x5F0F;&#x3001;&#x9759;&#x6001;&#x3001;&#x52A8;&#x6001;&#x3001;&#x987A;&#x5E8F;&#x5F0F;&#x3001;&#x57FA;&#x4E8E;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x7684;&#x5E76;&#x884C;&#x3001;&#x57FA;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x5185;&#x5B58;&#x7684;&#x5E76;&#x884C;&#x3001;&#x6570;&#x636E;&#x6D41;&#x3001;&#x9AD8;&#x7EA7;&#x548C;&#x4E2D;&#x95F4;&#x8BED;&#x8A00;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x7528;&#x4E8E;&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x3001;&#x7B26;&#x53F7;&#x64CD;&#x4F5C;&#x548C;&#x6570;&#x636E;&#x5E93;&#x8BBF;&#x95EE;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x7684;&#x591A;&#x6837;&#x6027;&#x5BF9;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x751F;&#x4EA7;&#x529B;&#x81F3;&#x5173;&#x91CD;&#x8981;&#xFF0C;&#x4E5F;&#x662F;&#x8BA1;&#x7B97;&#x5B66;&#x79D1;&#x7684;&#x91CD;&#x8981;&#x5185;&#x5BB9;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x4EE5;&#x5404;&#x79CD;&#x8BED;&#x8A00;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x4E86;&#x63A7;&#x5236;&#x6D41;&#x3001;&#x7C7B;&#x578B;&#x548C;&#x62BD;&#x8C61;&#x673A;&#x5236;&#x3002;&#x8FD9;&#x4E9B;&#x662F;&#x5F00;&#x53D1;&#x7ED3;&#x6784;&#x826F;&#x597D;&#x3001;&#x6A21;&#x5757;&#x5316;&#x3001;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x548C;&#x7EF4;&#x62A4;&#x7684;&#x7A0B;&#x5E8F;&#x57FA;&#x7840;&#x3002;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x6838;&#x5FC3;&#x7279;&#x6027;&#x53CA;&#x5176;&#x5728;&#x5F53;&#x4ECA;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x4F53;&#x73B0;&#xFF0C;&#x662F;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x9AD8;&#x6548;&#x7A0B;&#x5E8F;&#x5458;&#x548C;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x5F53;&#x4ECA;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x7684;&#x5B9E;&#x73B0;&#x548C;&#x8BBE;&#x8BA1;&#x5FC5;&#x987B;&#x4E00;&#x8D77;&#x7814;&#x7A76;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x8BED;&#x8A00;&#x7684;&#x6210;&#x529F;&#x4E0E;&#x5426;&#x53D6;&#x51B3;&#x4E8E;&#x5176;&#x5B9E;&#x73B0;&#x7684;&#x8D28;&#x91CF;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8BED;&#x8A00;&#x7684;&#x5B9E;&#x73B0;&#x6709;&#x65F6;&#x4F1A;&#x9650;&#x5236;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x8BED;&#x8A00;&#x7684;&#x5B9E;&#x73B0;&#x4ECE;&#x89E3;&#x6790;&#x548C;&#x8BCD;&#x6CD5;&#x626B;&#x63CF;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x662F;&#x8BA1;&#x7B97;&#x7A0B;&#x5E8F;&#x8BED;&#x6CD5;&#x7ED3;&#x6784;&#x6240;&#x8981;&#x6C42;&#x7684;&#x3002;&#x5982;&#x672C;&#x4E66;&#x7B2C;1&#x90E8;&#x5206;&#x6240;&#x8FF0;&#xFF0C;&#x5F53;&#x4ECA;&#x7684;&#x89E3;&#x6790;&#x6280;&#x672F;&#xFF0C;&#x662F;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x53D1;&#x660E;&#x7684;&#x6700;&#x7F8E;&#x4E3D;&#x7684;&#x7B97;&#x6CD5;&#x4E4B;&#x4E00;&#xFF0C;&#x4E5F;&#x662F;&#x4F7F;&#x7528;&#x6570;&#x5B66;&#x7406;&#x8BBA;&#x521B;&#x9020;&#x5B9E;&#x7528;&#x5DE5;&#x5177;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x89E3;&#x6790;&#x7B56;&#x7565;&#x503C;&#x5F97;&#x5B66;&#x4E60;&#xFF0C;&#x4E5F;&#x5177;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5B9E;&#x7528;&#x4EF7;&#x503C;&#x3002;&#x8981;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x7684;&#x4F1F;&#x5927;&#x4E4B;&#x5904;&#xFF0C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5B66;&#x4E60;&#x7B2C;&#x4E00;&#x4E2A;Fortran&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x7814;&#x7A76;&#x6784;&#x5EFA;&#x8BE5;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x5148;&#x9A71;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x64CD;&#x4F5C;&#x7B26;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5DE7;&#x5999;&#x5730;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x662F;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x5B83;&#x4EEC;&#x8D1F;&#x8D23;&#x628A;&#x8BED;&#x8A00;&#x7684;&#x9AD8;&#x7EA7;&#x8868;&#x793A;&#x8F6C;&#x6362;&#x5230;&#x9002;&#x5408;&#x7531;&#x7269;&#x7406;&#x673A;&#x6216;&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x7684;&#x4F4E;&#x7EA7;&#x5F62;&#x5F0F;&#x3002;&#x7FFB;&#x8BD1;&#x53EF;&#x4EE5;&#x63D0;&#x524D;&#x5B8C;&#x6210;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B8C;&#x6210;&#xFF0C;&#x6216;&#x8005;&#x517C;&#x800C;&#x6709;&#x4E4B;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x8BA8;&#x8BBA;&#x4E86;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x548C;&#x5B9E;&#x73B0;&#x7B56;&#x7565;&#xFF0C;&#x5305;&#x62EC;&#x89E3;&#x6790;&#x9A71;&#x52A8;&#x7684;&#x7FFB;&#x8BD1;&#x673A;&#x5236;&#x3002;&#x4E3A;&#x4E86;&#x751F;&#x6210;&#x9AD8;&#x6548;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x7FFB;&#x8BD1;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x4E86;&#x5404;&#x79CD;&#x7B56;&#x7565;&#x6765;&#x907F;&#x514D;&#x5197;&#x4F59;&#x8BA1;&#x7B97;&#xFF0C;&#x4E5F;&#x5229;&#x7528;&#x4E86;&#x5B58;&#x50A8;&#x7684;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x548C;&#x5904;&#x7406;&#x5668;&#x7684;&#x5E76;&#x884C;&#x6027;&#x3002;&#x8FD9;&#x4E9B;&#x6709;&#x65F6;&#x76F8;&#x4E92;&#x51B2;&#x7A81;&#x7684;&#x76EE;&#x6807;&#x662F;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x4F18;&#x5316;&#x7EC4;&#x4EF6;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x5185;&#x5BB9;&#x901A;&#x5E38;&#x4E0D;&#x5728;&#x7F16;&#x8BD1;&#x5668;&#x5165;&#x95E8;&#x8BFE;&#x7A0B;&#x7684;&#x6559;&#x5B66;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#xFF0C;&#x4F46;&#x672C;&#x4E66;&#x7684;&#x7B2C;4&#x90E8;&#x5206;&#x5F88;&#x597D;&#x5730;&#x4ECB;&#x7ECD;&#x4E86;&#x7A0B;&#x5E8F;&#x4F18;&#x5316;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x8FD1;&#x5E74;&#x6765;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x9886;&#x57DF;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x662F;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x3002;&#x5728;&#x53EF;&#x9884;&#x89C1;&#x7684;&#x672A;&#x6765;&#x5185;&#xFF0C;&#x8BA1;&#x7B97;&#x6027;&#x80FD;&#x7684;&#x63D0;&#x9AD8;&#x5C06;&#x4E3B;&#x8981;&#x6765;&#x6E90;&#x4E8E;&#x5E76;&#x884C;&#x6027;&#x7684;&#x6709;&#x6548;&#x5229;&#x7528;&#x3002;&#x672C;&#x4E66;&#x56DE;&#x987E;&#x4E86;&#x8FD9;&#x4E00;&#x53D1;&#x5C55;&#x8FC7;&#x7A0B;&#xFF0C;&#x5411;&#x8BFB;&#x8005;&#x4ECB;&#x7ECD;&#x4E86;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x4E3B;&#x9898;&#xFF0C;&#x5305;&#x62EC;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x3001;&#x901A;&#x4FE1;&#x548C;&#x534F;&#x8C03;&#x673A;&#x5236;&#x3002;&#x968F;&#x7740;&#x5E76;&#x884C;&#x53D8;&#x4E3A;&#x5E38;&#x89C4;&#x8BA1;&#x7B97;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x5C06;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x548C;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x6865;&#x6881;&#xFF0C;&#x56E0;&#x4E3A;&#x7B97;&#x6CD5;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x624D;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x3002;&#x7814;&#x7A76;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x5404;&#x65B9;&#x9762;&#x7684;&#x8BA1;&#x7B97;&#x7B56;&#x7565;&#xFF0C;&#x56E0;&#x6B64;&#x5177;&#x6709;&#x5F88;&#x5927;&#x7684;&#x6559;&#x5B66;&#x4EF7;&#x503C;&#x3002;Michael Scott&#x7684;&#x300A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x2014;&#x2014;&#x5B9E;&#x8DF5;&#x4E4B;&#x8DEF;&#x300B;&#x5BF9;&#x8FD9;&#x4E00;&#x4E3B;&#x9898;&#x8FDB;&#x884C;&#x4E86;&#x5E7F;&#x6CDB;&#x7684;&#x8BBA;&#x8FF0;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4F1F;&#x5927;&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;&#x4E5F;&#x662F;&#x5B9D;&#x8D35;&#x4FE1;&#x606F;&#x6765;&#x6E90;&#x3002;</p>
<p>David Padua</p>
<p>Siebel Center for Computer Science</p>
<p>University of Illinois at Urbana-Champaign</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 关于本书">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="preface.html" class="navigation navigation-next " aria-label="Next page: 前言">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"序言","level":"1.2","depth":1,"next":{"title":"前言","level":"1.3","depth":1,"path":"preface.md","ref":"preface.md","articles":[]},"previous":{"title":"关于本书","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"descrption":"Programming Language Pragmatics Fourth Edtion 中文版","theme":"default","author":"Michael L. Scott","margin":{"right":30,"left":30,"top":30,"bottom":50},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"978-0-12-410409-9","variables":{},"title":"程序设计语言 实践之路（第四版）","language":"zh-hans","gitbook":"*","direction":"ltr"},"file":{"path":"foreword.md","mtime":"2022-06-27T15:41:12.095Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-06-27T15:41:17.520Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

