
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>前言 · 程序设计语言 实践之路（第四版）</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Michael L. Scott">
        <meta name="identifier" content="978-0-12-410409-9" scheme="ISBN">
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="part1/" />
    
    
    <link rel="prev" href="foreword.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="part1/">
            
                <a href="part1/">
            
                    
                    第1部分 基础
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="part1/ch1/">
            
                <a href="part1/ch1/">
            
                    
                    第1章 绪论
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1.1" data-path="part1/ch1/1-1.html">
            
                <a href="part1/ch1/1-1.html">
            
                    
                    1.1 程序设计语言设计的艺术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.2" data-path="part1/ch1/1-2.html">
            
                <a href="part1/ch1/1-2.html">
            
                    
                    1.2 程序设计语言族谱
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.3" data-path="part1/ch1/1-3.html">
            
                <a href="part1/ch1/1-3.html">
            
                    
                    1.3 为什么学习程序设计语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.4" data-path="part1/ch1/1-4.html">
            
                <a href="part1/ch1/1-4.html">
            
                    
                    1.4 编译器和解释器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.5" data-path="part1/ch1/1-5.html">
            
                <a href="part1/ch1/1-5.html">
            
                    
                    1.5 编程环境
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >前言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1>
<p>&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BFE;&#x7A0B;&#x662F;&#x5B66;&#x751F;&#x4FEE;&#x8BFB;&#x7684;&#x7B2C;&#x4E00;&#x95E8;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x8BFE;&#x7A0B;&#x3002;&#x4FEE;&#x8BFB;&#x8FD9;&#x95E8;&#x8BFE;&#x7A0B;&#x4E4B;&#x524D;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x5B66;&#x751F;&#x90FD;&#x4F7F;&#x7528;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4F8B;&#x5982;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x3001;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x3001;&#x6E38;&#x620F;&#x3001;&#x7F51;&#x9875;&#x6D4F;&#x89C8;&#x3001;&#x6587;&#x5B57;&#x5904;&#x7406;&#x548C;&#x8BB8;&#x591A;&#x5176;&#x5B83;&#x5E94;&#x7528;&#xFF0C;&#x4F46;&#x76F4;&#x5230;&#x4ED6;&#x4EEC;&#x7F16;&#x5199;&#x7B2C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x4ED6;&#x4EEC;&#x624D;&#x5F00;&#x59CB;&#x4E86;&#x89E3;&#x7A0B;&#x5E8F;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;&#x5728;&#x83B7;&#x5F97;&#x4E86;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6280;&#x80FD;&#x540E;&#xFF08;&#x5927;&#x6982;&#x662F;&#x4FEE;&#x8BFB;&#x8FC7;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#x8BFE;&#x7A0B;&#x540E;&#xFF09;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x81EA;&#x7136;&#x662F;&#x60F3;&#x77E5;&#x9053;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002;&#x672C;&#x4E66;&#x5BF9;&#x6B64;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#xFF0C;&#x5B83;&#x7684;&#x76EE;&#x6807;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x8981;&#x6210;&#x4E3A;&#x6700;&#x5168;&#x9762;&#x3001;&#x6700;&#x51C6;&#x786E;&#x7684;&#x8BED;&#x8A00;&#x6559;&#x6750;&#xFF0C;&#x540C;&#x65F6;&#x4EE5;&#x4E00;&#x79CD;&#x5438;&#x5F15;&#x4EBA;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x80FD;&#x4E3A;&#x591A;&#x6570;&#x672C;&#x79D1;&#x751F;&#x6240;&#x63A5;&#x53D7;&#x3002;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x53CD;&#x6620;&#x4E86;&#x6211;&#x7684;&#x4FE1;&#x5FF5;&#xFF0C;&#x5373;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x89E3;&#x91CA;&#x5230;&#x5E95;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x5B66;&#x751F;&#x4EEC;&#x4F1A;&#x7406;&#x89E3;&#x5F97;&#x66F4;&#x591A;&#xFF0C;&#x4E5F;&#x4F1A;&#x66F4;&#x559C;&#x6B22;&#x3002;</p>
<p>&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x201C;&#x7CFB;&#x7EDF;&#x201D;&#x8BFE;&#x7A0B;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x53EF;&#x80FD;&#x8FD8;&#x6709;&#x8BA1;&#x7B97;&#x673A;&#x7EC4;&#x7EC7;&#xFF09;&#x4E4B;&#x5916;&#x7684;&#x5185;&#x5BB9;&#x5F80;&#x5F80;&#x88AB;&#x5212;&#x5206;&#x4E3A;&#x8BB8;&#x591A;&#x72EC;&#x7ACB;&#x7684;&#x8BFE;&#x7A0B;&#xFF0C;&#x5305;&#x62EC;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3001;&#x7F16;&#x8BD1;&#x5668;&#x6784;&#x9020;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x7F51;&#x7EDC;&#x3001;&#x5E76;&#x884C;&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x3001;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x5305;&#x62EC;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x8BBE;&#x8BA1;&#x3001;&#x56FE;&#x5F62;&#x6216;&#x7528;&#x6237;&#x754C;&#x9762;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x79CD;&#x5212;&#x5206;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x8BFE;&#x7A0B;&#x91CF;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#xFF0C;&#x4F46;&#x5B66;&#x58EB;&#x5B66;&#x4F4D;&#x8BFE;&#x7A0B;&#x7684;&#x5B66;&#x671F;&#x6570;&#x5374;&#x6CA1;&#x6709;&#x589E;&#x52A0;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E2D;&#x8BB8;&#x591A;&#x6700;&#x6709;&#x8DA3;&#x7684;&#x53D1;&#x73B0;&#x90FD;&#x4EA7;&#x751F;&#x4E8E;&#x5728;&#x5B66;&#x79D1;&#x4E4B;&#x95F4;&#x7684;&#x7ED3;&#x5408;&#x4E0A;&#xFF0C;&#x4F8B;&#x5982;50&#x591A;&#x5E74;&#x6765;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x548C;&#x7F16;&#x8BD1;&#x5668;&#x4F34;&#x968F;&#x7740;&#x51E0;&#x4EE3;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x3001;&#x6D41;&#x6C34;&#x7EBF;&#x5FAE;&#x5904;&#x7406;&#x5668;&#x3001;&#x591A;&#x6838;&#x82AF;&#x7247;&#x548C;&#x73B0;&#x4EE3;GPU&#x7684;&#x6F14;&#x8FDB;&#x5171;&#x540C;&#x53D1;&#x5C55;&#x3002;&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x5341;&#x5E74;&#x91CC;&#xFF0C;&#x865A;&#x62DF;&#x5316;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x6A21;&#x7CCA;&#x4E86;&#x786C;&#x4EF6;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x8BED;&#x8A00;&#x8FD0;&#x884C;&#x65F6;&#x4E4B;&#x95F4;&#x7684;&#x5206;&#x754C;&#x7EBF;&#xFF0C;&#x5E76;&#x63A8;&#x52A8;&#x4E86;&#x4E91;&#x8BA1;&#x7B97;&#x7684;&#x7206;&#x70B8;&#x5F0F;&#x53D1;&#x5C55;&#x3002;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x6280;&#x672F;&#x5DF2;&#x7ECF;&#x5D4C;&#x5165;&#x5230;&#x4ECE;&#x52A8;&#x6001;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x5230;&#x6E38;&#x620F;&#x548C;&#x5A31;&#x4E50;&#xFF0C;&#x518D;&#x5230;&#x5B89;&#x5168;&#x548C;&#x91D1;&#x878D;&#x7684;&#x4E00;&#x5207;&#x4E8B;&#x7269;&#x4E2D;&#x3002;</p>
<p>&#x540C;&#x65F6;&#x5B66;&#x9662;&#x6D3E;&#x548C;&#x5DE5;&#x7A0B;&#x6D3E;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x5F3A;&#x8C03;&#x8FD9;&#x79CD;&#x4E92;&#x52A8;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x9AD8;&#x7B49;&#x6559;&#x80B2;&#x9886;&#x57DF;&#xFF0C;&#x6838;&#x5FC3;&#x8BFE;&#x7A0B;&#x7684;&#x6574;&#x5408;&#x8D8B;&#x52BF;&#x8D8A;&#x6765;&#x8D8A;&#x660E;&#x663E;&#x3002;&#x8BB8;&#x591A;&#x5B66;&#x6821;&#x6CA1;&#x6709;&#x8BA9;&#x5B66;&#x751F;&#x5728;&#x5176;&#x5B83;&#x79D1;&#x76EE;&#x4E0A;&#x5B58;&#x5728;&#x77ED;&#x677F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53EA;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#x4E24;&#x4E09;&#x95E8;&#x79D1;&#x76EE;&#xFF0C;&#x800C;&#x662F;&#x4FEE;&#x6539;&#x4E86;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x7EC4;&#x7EC7;&#x8BFE;&#x7A0B;&#x4EE5;&#x6DB5;&#x76D6;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x5E76;&#x5728;&#x4E0D;&#x540C;&#x4E13;&#x4E1A;&#x5F00;&#x8BBE;&#x4E86;&#x540E;&#x7EED;&#x9009;&#x4FEE;&#x8BFE;&#x3002;&#x8FD9;&#x4E00;&#x8D8B;&#x52BF;&#x4E0E;ACM/IEEECS Computer Science Curricula 2013 guidelines[SR13]&#x975E;&#x5E38;&#x4E00;&#x81F4;&#xFF0C;&#x8BE5;&#x6307;&#x5357;&#x5F3A;&#x8C03;&#x9700;&#x8981;&#x63A7;&#x5236;&#x8BFE;&#x7A0B;&#x89C4;&#x6A21;&#xFF0C;&#x57F9;&#x517B;&#x201C;&#x7CFB;&#x7EDF;&#x7EA7;&#x89C6;&#x89D2;&#x201D;&#x548C;&#x5BF9;&#x7406;&#x8BBA;&#x548C;&#x5B9E;&#x8DF5;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x8054;&#x7CFB;&#x7684;&#x7406;&#x89E3;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8BE5;&#x6307;&#x5357;&#x7279;&#x522B;&#x6307;&#x51FA;&#xFF1A;</p>
<p>&#x201C;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E13;&#x4E1A;&#x7684;&#x6BD5;&#x4E1A;&#x751F;&#x9700;&#x8981;&#x4ECE;&#x591A;&#x4E2A;&#x7EC6;&#x8282;&#x548C;&#x62BD;&#x8C61;&#x5C42;&#x9762;&#x8FDB;&#x884C;&#x601D;&#x8003;&#x3002;&#x8FD9;&#x79CD;&#x7406;&#x89E3;&#x5E94;&#x8BE5;&#x8D85;&#x8D8A;&#x5404;&#x4E2A;&#x7EC4;&#x4EF6;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x5305;&#x62EC;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x53CA;&#x5176;&#x6784;&#x5EFA;&#x548C;&#x5206;&#x6790;&#x8FC7;&#x7A0B;&#x7684;&#x7406;&#x89E3;[p.24]&#x3002;&#x201D;</p>
<p>&#x5BF9;&#x4E8E;&#x672C;&#x4E66;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x4F5C;&#x8005;&#x5199;&#x9053;&#xFF1A;</p>
<p>&#x201C;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x7CBE;&#x786E;&#x63CF;&#x8FF0;&#x6982;&#x5FF5;&#x3001;&#x5236;&#x5B9A;&#x7B97;&#x6CD5;&#x548C;&#x63A8;&#x7406;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x5A92;&#x4ECB;&#x3002;&#x5728;&#x6574;&#x4E2A;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x4E2D;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;&#x4F1A;&#x5206;&#x522B;&#x6216;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x7406;&#x89E3;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x5728;&#x591A;&#x4E2A;&#x4E92;&#x8865;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x4E2D;&#x505A;&#x51FA;&#x660E;&#x667A;&#x7684;&#x8BBE;&#x8BA1;&#x9009;&#x62E9;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;&#x901A;&#x5E38;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x65B0;&#x7684;&#x8BED;&#x8A00;&#x548C;&#x7F16;&#x7A0B;&#x7ED3;&#x6784;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x7406;&#x89E3;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x7684;&#x7279;&#x6027;&#x662F;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x3001;&#x7EC4;&#x5408;&#x548C;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x6709;&#x6548;&#x4F7F;&#x7528;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x5E76;&#x8BA4;&#x8BC6;&#x5176;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x638C;&#x63E1;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x7FFB;&#x8BD1;&#x548C;&#x9759;&#x6001;&#x7A0B;&#x5E8F;&#x5206;&#x6790;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD0;&#x884C;&#x65F6;&#x7EC4;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982;&#x5185;&#x5B58;&#x7BA1;&#x7406;[p.155]&#x3002;&#x201D;</p>
<p>&#x672C;&#x4E66;&#x7684;&#x524D;&#x4E09;&#x4E2A;&#x7248;&#x672C;&#x6709;&#x5E78;&#x987A;&#x5E94;&#x4E86;&#x7EFC;&#x5408;&#x7406;&#x89E3;&#x7684;&#x8D8B;&#x52BF;&#x3002;&#x7B2C;&#x56DB;&#x7248;&#x52A0;&#x5F3A;&#x4E86;&#x201C;&#x7CFB;&#x7EDF;&#x7EA7;&#x7406;&#x89E3;&#x201D;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x7559;&#x4E86;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x7684;&#x6838;&#x5FC3;&#x5173;&#x6CE8;&#x70B9;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x662F;&#x4E00;&#x672C;&#x5173;&#x4E8E;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x4E66;&#x3002;&#x672C;&#x4E66;&#x4E0D;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5217;&#x4E3E;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x800C;&#x662F;&#x4FA7;&#x91CD;&#x4E8E;&#x5B66;&#x751F;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x7684;&#x6240;&#x6709;&#x8BED;&#x8A00;&#x80CC;&#x540E;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x7528;&#x5404;&#x79CD;&#x5177;&#x4F53;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#x660E;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x89E3;&#x91CA;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x4E3A;&#x4F55;&#x4EE5;&#x4E0D;&#x540C;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x672C;&#x4E66;&#x6CA1;&#x6709;&#x89E3;&#x91CA;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x7F16;&#x8BD1;&#x5668;&#x6216;&#x89E3;&#x91CA;&#x5668;&#xFF08;&#x5F88;&#x5C11;&#x6709;&#x7A0B;&#x5E8F;&#x5458;&#x4F1A;&#x5B8C;&#x6574;&#x5730;&#x5B8C;&#x6210;&#x8FD9;&#x9879;&#x4EFB;&#x52A1;&#xFF09;&#xFF0C;&#x800C;&#x662F;&#x5173;&#x6CE8;&#x7F16;&#x8BD1;&#x5668;&#x5BF9;&#x8F93;&#x5165;&#x7A0B;&#x5E8F;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x4EE5;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x662F;&#x4E00;&#x8D77;&#x63A2;&#x8BA8;&#x7684;&#xFF0C;&#x5E76;&#x7740;&#x91CD;&#x5F3A;&#x8C03;&#x5B83;&#x4EEC;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<h2 id="&#x7B2C;&#x56DB;&#x7248;&#x7684;&#x53D8;&#x5316;">&#x7B2C;&#x56DB;&#x7248;&#x7684;&#x53D8;&#x5316;</h2>
<p>&#x76F8;&#x5BF9;&#x4E8E;&#x524D;&#x4E09;&#x7248;&#xFF0C;&#x7B2C;&#x56DB;&#x7248;&#xFF1A;</p>
<ol>
<li>&#x65B0;&#x589E;&#x4E86;&#x4E13;&#x95E8;&#x8BA8;&#x8BBA;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x548C;&#x590D;&#x5408;&#x7C7B;&#x578B;&#x7684;&#x7AE0;&#x8282;&#xFF0C;&#x5220;&#x9664;&#x4E86;&#x65E7;&#x7248;&#x4E2D;&#x5173;&#x4E8E;&#x7C7B;&#x578B;&#x7684;&#x5355;&#x4E00;&#x7AE0;&#x8282;</li>
<li>&#x66F4;&#x65B0;&#x4E86;&#x5BF9;&#x51FD;&#x6570;&#x5F0F;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x5173;&#x4E8E;OCaml&#x7684;&#x5185;&#x5BB9;</li>
<li>&#x4ECB;&#x7ECD;&#x4E86;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x9886;&#x57DF;&#x7684;&#x8BB8;&#x591A;&#x53D8;&#x5316;</li>
<li>&#x5BF9;&#x6559;&#x5E08;&#x53CD;&#x9988;&#x7684;&#x6539;&#x8FDB;&#x548C;&#x5BF9;&#x76F8;&#x5173;&#x4E3B;&#x9898;&#x91CD;&#x65B0;&#x6574;&#x5408;</li>
</ol>
<p>&#x7B2C;1&#x9879;&#x53EF;&#x80FD;&#x662F;&#x6700;&#x660E;&#x663E;&#x7684;&#x53D8;&#x5316;&#x3002;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x7B2C;7&#x7AE0;&#x662F;&#x6700;&#x957F;&#x7684;&#x4E00;&#x7AE0;&#xFF0C;&#x4F46;&#x5374;&#x5305;&#x542B;&#x4E24;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3002;&#x7B2C;&#x56DB;&#x7248;&#x91CD;&#x65B0;&#x6574;&#x7406;&#x4E86;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x660E;&#x786E;&#x5730;&#x5173;&#x6CE8;&#x7C7B;&#x578B;&#x63A8;&#x7406;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5B83;&#x5728;ML&#x5BB6;&#x65CF;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x7B2C;&#x56DB;&#x7248;&#x8FD8;&#x66F4;&#x65B0;&#x548C;&#x91CD;&#x7EC4;&#x4E86;&#x53C2;&#x6570;&#x591A;&#x6001;&#x6027;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x4EE5;&#x524D;&#x5206;&#x6563;&#x5728;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x3002;</p>
<p>&#x7B2C;2&#x9879;&#x8868;&#x660E;&#xFF0C;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x5DF2;&#x7ECF;&#x6E10;&#x6E10;&#x878D;&#x5165;&#x4E3B;&#x6D41;&#x547D;&#x4EE4;&#x5F0F;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x4EE5;&#x53CA;SML&#x3001;OCaml&#x548C;Haskell&#x5728;&#x6559;&#x80B2;&#x754C;&#x548C;&#x5DE5;&#x4E1A;&#x754C;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x6027;&#x4E5F;&#x65E5;&#x76CA;&#x7A81;&#x51FA;&#x3002;&#x8FD9;&#x4E00;&#x7248;&#x4E2D;&#x5305;&#x542B;OCaml&#x548C;Scheme&#x4E24;&#x79CD;&#x8BED;&#x8A00;&#x7684;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x5982;&#x524D;&#x4E00;&#x6BB5;&#x6240;&#x8FF0;&#xFF0C;&#x7B2C;&#x56DB;&#x7248;&#x4E2D;&#x5305;&#x542B;&#x4E13;&#x95E8;&#x7684;&#x7AE0;&#x8282;&#xFF08;7.2.4&#xFF09;&#x6765;&#x63CF;&#x8FF0;ML&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x3002;11.4&#x8282;&#x662F;OCaml&#x7684;&#x6982;&#x8FF0;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;&#x7B49;&#x5F0F;&#x548C;&#x987A;&#x5E8F;&#x3001;&#x7ED1;&#x5B9A;&#x548C;lambda&#x8868;&#x8FBE;&#x5F0F;&#x3001;&#x7C7B;&#x578B;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3001;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x3001;&#x63A7;&#x5236;&#x6D41;&#x548C;&#x526F;&#x4F5C;&#x7528;&#x3002;&#x672C;&#x4E66;&#x9009;&#x62E9;OCaml&#x800C;&#x4E0D;&#x662F;Haskell&#x4F5C;&#x4E3A;ML&#x5BB6;&#x65CF;&#x8BED;&#x8A00;&#x7684;&#x4F8B;&#x5B50;&#x53CD;&#x6620;&#x4E86;&#x5B83;&#x5728;&#x5DE5;&#x4E1A;&#x4E2D;&#x7684;&#x5730;&#x4F4D;&#x3002;&#x540C;&#x65F6;&#x8BFE;&#x5802;&#x7ECF;&#x9A8C;&#x8868;&#x660E;&#xFF0C;&#x81F3;&#x5C11;&#x5BF9;&#x8BB8;&#x591A;&#x5B66;&#x751F;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x5177;&#x5907;&#x4E86;&#x51FD;&#x6570;&#x77E5;&#x8BC6;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x6700;&#x521D;&#x63A5;&#x89E6;&#x51FD;&#x6570;&#x5F0F;&#x601D;&#x7EF4;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x3002;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x5E0C;&#x671B;&#x6211;&#x9009;&#x62E9;Haskell&#x8BED;&#x8A00;&#x7684;&#x540C;&#x4E8B;&#x4EEC;&#xFF0C;&#x6211;&#x6DF1;&#x8868;&#x6B49;&#x610F;&#xFF01;</p>
<p>&#x5176;&#x5B83;&#x65B0;&#x5185;&#x5BB9;&#xFF08;&#x7B2C;3&#x9879;&#xFF09;&#x5219;&#x8D2F;&#x7A7F;&#x5168;&#x6587;&#x3002;&#x5728;&#x9002;&#x5F53;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x672C;&#x4E66;&#x4F1A;&#x53C2;&#x8003;&#x6700;&#x65B0;&#x8BED;&#x8A00;&#x548C;&#x6807;&#x51C6;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5305;&#x62EC;C&amp;C++11&#x3001;Java 8&#x3001;C# 5&#x3001;Scala&#x3001;Go&#x3001;Swift&#x3001;Python 3&#x548C;HTML 5&#x3002;3.6.4&#x8282;&#x603B;&#x7ED3;&#x4E86;&#x4E4B;&#x524D;&#x5BF9;lambda&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x5E76;&#x5C55;&#x793A;&#x4E86;lambda&#x8868;&#x8FBE;&#x5F0F;&#x662F;&#x5982;&#x4F55;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x5404;&#x79CD;&#x547D;&#x4EE4;&#x5F0F;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x3002;10.4.4&#x8282;&#x8865;&#x5145;&#x4E86;&#x5BF9;&#x8C61;&#x95ED;&#x5305;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5305;&#x62EC;C++11&#x7684;<code>std::function</code>&#x548C;<code>std::bind</code>&#x3002;C-5.4.5&#x8282;&#x4ECB;&#x7ECD;&#x7684;x86-64&#x548C;ARM&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x53D6;&#x4EE3;&#x4E86;&#x65E7;&#x7248;&#x672C;&#x4E2D;&#x7684;x86-32&#x548C;MIPS&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x5173;&#x4E8E;&#x8C03;&#x7528;&#x5E8F;&#x5217;&#xFF08;9.2&#xFF09;&#x548C;&#x94FE;&#x63A5;&#xFF08;15.6&#xFF09;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#x4E5F;&#x662F;&#x57FA;&#x4E8E;&#x8FD9;&#x4E24;&#x79CD;&#x67B6;&#x6784;&#x7684;&#x3002;x86&#x8C03;&#x7528;&#x5E8F;&#x5217;&#x7684;&#x63CF;&#x8FF0;&#x4EC5;&#x9650;&#x4E8E;gcc&#xFF0C;&#x5BF9;&#x4E8E;ARM&#x5219;&#x4F7F;&#x7528;LLVM&#x3002;8.5.3&#x8282;&#x4ECB;&#x7ECD;&#x4E86;&#x667A;&#x80FD;&#x6307;&#x9488;&#x3002;9.3.1&#x8282;&#x4ECB;&#x7ECD;&#x4E86;&#x53F3;&#x503C;&#x5F15;&#x7528;&#x3002;&#x5728;9.6.2&#x8282;&#x7684;&#x56FE;&#x4E2D;&#xFF0C;JavaFX&#x53D6;&#x4EE3;&#x4E86;Swing&#x3002;&#x9644;&#x5F55;A&#x4E2D;&#x65B0;&#x589E;&#x4E86;Go&#x3001;Lua&#x3001;Rust&#x3001;Scala&#x548C;Swift&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x7B2C;4&#x9879;&#x5305;&#x62EC;&#x5BF9;&#x5168;&#x4E66;&#x51E0;&#x4E4E;&#x6BCF;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x6539;&#x8FDB;&#xFF0C;&#x8F83;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x66F4;&#x65B0;&#x5305;&#x62EC;&#x8DDF;&#x8E2A;&#xFF08;follow&#xFF09;&#x548C;&#x9884;&#x6D4B;&#xFF08;predict&#xFF09;&#x96C6;&#xFF08;2.3.3&#x8282;&#xFF09;&#x3001;&#x9012;&#x5F52;&#x4E0B;&#x964D;&#x7684;Wirth&#x9519;&#x8BEF;&#x6062;&#x590D;&#x7B97;&#x6CD5;&#xFF08;C-2.3.5&#x8282;&#xFF09;&#x3001;&#x91CD;&#x8F7D;&#xFF08;3.5.2&#x8282;&#xFF09;&#x3001;&#x6A21;&#x5757;&#xFF08;3.3.4&#x8282;&#xFF09;&#x3001;&#x9E2D;&#x5B50;&#x7C7B;&#x578B;&#xFF08;duck typing&#xFF09;&#xFF08;7.3&#xFF09;&#x3001;&#x8BB0;&#x5F55;&#x548C;&#x53D8;&#x4F53;&#xFF08;8.1&#x8282;&#xFF09;&#x3001;&#x6CE8;&#x5165;&#x5217;&#x8868;&#xFF08;intrusive lists&#xFF09;&#xFF08;&#x5220;&#x9664;&#x4E86;&#x7B2C;10&#x7AE0;&#x7684;&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#xFF09;&#x3001;&#x9759;&#x6001;&#x57DF;&#xFF08;static fields&#xFF09;&#x548C;&#x65B9;&#x6CD5;&#xFF08;10.2.2&#xFF09;&#x3001;&#x6DF7;&#x5408;&#x7EE7;&#x627F;&#xFF08;&#x4ECE;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x79FB;&#x56DE;&#x5230;&#x4E66;&#x4E2D;&#xFF0C;&#x5185;&#x5BB9;&#x6DB5;&#x76D6;Scala traits&#x548C;Java 8&#x7684;&#x9ED8;&#x8BA4;&#x65B9;&#x6CD5;&#xFF09;&#x3001;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#xFF08;&#x5BF9;&#x7B2C;13&#x7AE0;&#x7684;&#x666E;&#x904D;&#x4FEE;&#x6539;&#xFF09;&#x3001;phasers&#xFF08;13.3.1&#x8282;&#xFF09;&#x3001;&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF08;13.3.3&#x8282;&#xFF09;&#x3001;&#x4FE1;&#x53F7;&#x91CF;&#xFF08;13.3.5&#x8282;&#xFF09;&#x3001;future&#xFF08;13.4.5&#x8282;&#xFF09;&#x3001;GIMPLE&#x548C;RTL&#xFF08;c-15.2.1&#x8282;&#xFF09;&#x3001;QEMU&#xFF08;16.2.2&#x8282;&#xFF09;&#x3001;DWARF&#xFF08;16.3.2&#x8282;&#xFF09;&#x548C;&#x8BED;&#x8A00;&#x8C31;&#x7CFB;&#xFF08;&#x56FE;A.1&#xFF09;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#x6750;&#x6599;&#xFF0C;&#x4E00;&#x4E9B;&#x65E7;&#x7684;&#x5185;&#x5BB9;&#x7684;&#x88AB;&#x538B;&#x7F29;&#x751A;&#x81F3;&#x5220;&#x9664;&#x4E86;&#xFF0C;&#x5305;&#x62EC;&#x6A21;&#x5757;&#xFF08;&#x7B2C;3&#x7AE0;&#x548C;&#x7B2C;10&#x7AE0;&#xFF09;&#x3001;&#x53D8;&#x4F53;&#x8BB0;&#x5F55;&#x548C;<code>with</code>&#x8BED;&#x53E5;&#xFF08;&#x7B2C;8&#x7AE0;&#xFF09;&#x4EE5;&#x53CA;&#x5143;&#x5FAA;&#x73AF;&#x89E3;&#x91CA;&#x5668;&#xFF08;&#x7B2C;11&#x7AE0;&#xFF09;&#xFF0C;&#x516C;&#x5171;&#x8BED;&#x8A00;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF08;CLI&#xFF09;&#x5DF2;&#x7ECF;&#x8F6C;&#x79FB;&#x5230;&#x4E86;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x3002;&#x67D0;&#x4E9B;&#x4ECE;&#x8FC7;&#x65F6;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x63D0;&#x53D6;&#x7684;&#x4F8B;&#x5B50;&#x5DF2;&#x7ECF;&#x88AB;&#x5F53;&#x524D;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x8A00;&#x66FF;&#x4EE3;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5173;&#x4E8E;Pascal&#x548C;Modula&#x7684;&#x53D9;&#x8FF0;&#x90FD;&#x53EA;&#x662F;&#x4ECB;&#x7ECD;&#x5176;&#x5386;&#x53F2;&#x800C;&#x5DF2;&#x3002;Occam&#x548C;Tcl&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x4E5F;&#x5DF2;&#x88AB;&#x5220;&#x9664;&#x3002;</p>
<p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x672C;&#x4E66;&#x589E;&#x52A0;&#x4E86;&#x5927;&#x7EA6;40&#x9875;&#xFF0C;&#x5305;&#x62EC;5&#x4E2A;&#x201C;&#x8BBE;&#x8BA1;&#x4E0E;&#x5B9E;&#x73B0;&#x201D;&#x4FA7;&#x680F;&#xFF0C;35&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x4EE5;&#x53CA;&#x5927;&#x7EA6;25&#x4E2A;&#x65B0;&#x7684;&#x8282;&#x672B;&#x7EC3;&#x4E60;&#x548C;&#x63A2;&#x7D22;&#x9898;&#x3002;&#x4E3A;&#x4E86;&#x5EFA;&#x7ACB;&#x4E00;&#x81F4;&#x548C;&#x5168;&#x9762;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x4F5C;&#x8005;&#x6295;&#x5165;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x7CBE;&#x529B;&#x3002;&#x6B63;&#x5982;&#x672C;&#x4E66;&#x7684;&#x524D;&#x51E0;&#x7248;&#x4E00;&#x6837;&#xFF0C;Morgan Kaufmann&#x516C;&#x53F8;&#x4E00;&#x76F4;&#x81F4;&#x529B;&#x4E8E;&#x4EE5;&#x5408;&#x7406;&#x7684;&#x6210;&#x672C;&#x51FA;&#x7248;&#x672C;&#x4E66;&#xFF1A;&#x672C;&#x4E66;&#x7B2C;&#x56DB;&#x7248;&#x7684;&#x4EF7;&#x683C;&#x8FDC;&#x4F4E;&#x4E8E;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#xFF0C;&#x4F46;&#x5185;&#x5BB9;&#x5374;&#x66F4;&#x5168;&#x9762;&#x3002;</p>
<h3 id="&#x914D;&#x5957;&#x7F51;&#x7AD9;">&#x914D;&#x5957;&#x7F51;&#x7AD9;</h3>
<p>&#x4E3A;&#x4E86;&#x5728;&#x6DFB;&#x52A0;&#x65B0;&#x5185;&#x5BB9;&#x540E;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x672C;&#x4E66;&#x7684;&#x539A;&#x5EA6;&#xFF0C;&#x5E76;&#x8BA9;&#x5B66;&#x751F;&#x5728;&#x9605;&#x8BFB;&#x65F6;&#x4E13;&#x6CE8;&#x4E8E;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5927;&#x7EA6;350&#x9875;&#x7684;&#x9AD8;&#x7EA7;&#x4E3B;&#x9898;&#x6216;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x653E;&#x5728;&#x4E86;<a href="booksite.elsevier.com/web/9780124104099">&#x914D;&#x5957;&#x7F51;&#x7AD9;</a>&#x4E0A;&#x3002;&#x4E66;&#x4E2D;&#x5BF9;&#x6BCF;&#x4E2A;&#x5728;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#xFF08;CS&#xFF09;&#x4E0A;&#x7684;&#x7AE0;&#x8282;&#x90FD;&#x8FDB;&#x884C;&#x4E86;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;&#xFF0C;&#x201C;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x201D;&#x90E8;&#x5206;&#x5BF9;&#x7701;&#x7565;&#x7684;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x4E86;&#x603B;&#x7ED3;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x7740;&#x76F8;&#x5173;&#x6280;&#x672F;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x5B83;&#x53EA;&#x610F;&#x5473;&#x7740;&#x672C;&#x4E66;&#x6DB5;&#x76D6;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x800C;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x662F;&#x672C;&#x4E66;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5B66;&#x671F;&#x7684;&#x6388;&#x8BFE;&#x5185;&#x5BB9;&#x3002;&#x7531;&#x4E8E;&#x504F;&#x597D;&#x548C;&#x6559;&#x5B66;&#x5927;&#x7EB2;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x6559;&#x5E08;&#x53EF;&#x80FD;&#x4F1A;&#x5E03;&#x7F6E;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x4E2D;&#x7684;&#x9605;&#x8BFB;&#x5185;&#x5BB9;&#xFF0C;&#x66F4;&#x53EF;&#x80FD;&#x4F1A;&#x907F;&#x514D;&#x8BB2;&#x8FF0;&#x4E66;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x5185;&#x5BB9;&#x3002;&#x6211;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5C06;&#x591A;&#x6570;&#x8BFE;&#x7A0B;&#x53EF;&#x80FD;&#x6DB5;&#x76D6;&#x7684;&#x5185;&#x5BB9;&#x4FDD;&#x7559;&#x4E66;&#x4E2D;&#x3002;</p>
<p>&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x4E2D;&#x8FD8;&#x5305;&#x62EC;&#x5728;&#x7EBF;&#x8D44;&#x6E90;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x4EE5;&#x53CA;&#x4E66;&#x4E2D;&#x6240;&#x6709;&#xFF08;&#x4E8C;&#x5341;&#x591A;&#x79CD;&#x8BED;&#x8A00;&#xFF09;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<h3 id="&#x8BBE;&#x8BA1;&#x4E0E;&#x5B9E;&#x73B0;&#x4FA7;&#x8FB9;&#x680F;">&#x8BBE;&#x8BA1;&#x4E0E;&#x5B9E;&#x73B0;&#x4FA7;&#x8FB9;&#x680F;</h3>
<p>&#x548C;&#x524D;&#x51E0;&#x7248;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E00;&#x7248;&#x4F9D;&#x7136;&#x975E;&#x5E38;&#x5F3A;&#x8C03;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x5BF9;&#x5B9E;&#x73B0;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x8FD8;&#x6709;&#x5B9E;&#x73B0;&#x5BF9;&#x8BBE;&#x8BA1;&#x5F71;&#x54CD;&#x3002;140&#x591A;&#x4E2A;&#x201C;&#x8BBE;&#x8BA1;&#x4E0E;&#x5B9E;&#x73B0;&#x201D;&#x4FA7;&#x8FB9;&#x680F;&#x5F3A;&#x8C03;&#x4E86;&#x5176;&#x4E2D;&#x7684;&#x8054;&#x7CFB;&#x548C;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;&#x4FA7;&#x8FB9;&#x680F;1.1&#x4E2D;&#x6709;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x4ECB;&#x7ECD;&#x3002;&#x9644;&#x5F55;B&#x4E2D;&#x5217;&#x51FA;&#x4E86;&#x7F16;&#x53F7;&#x3002;</p>
<h3 id="&#x4E66;&#x4E2D;&#x5E26;&#x7F16;&#x53F7;&#x4F8B;&#x5B50;">&#x4E66;&#x4E2D;&#x5E26;&#x7F16;&#x53F7;&#x4F8B;&#x5B50;</h3>
<p>&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#x4E0E;&#x6F14;&#x793A;&#x6D41;&#x7A0B;&#x7D27;&#x5BC6;&#x76F8;&#x8FDE;&#x3002;&#x4E3A;&#x4E86;&#x66F4;&#x5BB9;&#x6613;&#x7684;&#x627E;&#x5230;&#x5177;&#x4F53;&#x7684;&#x4F8B;&#x5B50;&#x3001;&#x8BB0;&#x4F4F;&#x5B83;&#x4EEC;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5E76;&#x5728;&#x5176;&#x5B83;&#x5730;&#x65B9;&#x5F15;&#x7528;&#x5B83;&#x4EEC;&#xFF0C;&#x65C1;&#x6CE8;&#x4E2D;&#x6807;&#x8BC6;&#x4E86;&#x6BCF;&#x4E2A;&#x4F8B;&#x5B50;&#x7684;&#x7F16;&#x53F7;&#x548C;&#x6807;&#x9898;&#x3002;&#x5168;&#x4E66;&#x548C;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x4E2D;&#x6709;1000&#x591A;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x8BE6;&#x89C1;&#x9644;&#x5F55;C&#x3002;</p>
<h3 id="&#x7EC3;&#x4E60;&#x9898;">&#x7EC3;&#x4E60;&#x9898;</h3>
<p>&#x5728;&#x6BCF;&#x4E00;&#x8282;&#x7684;&#x540E;&#x9762;&#xFF08;&#x5927;&#x7EA6;&#x6BCF;10&#x9875;&#xFF09;&#x6709;&#x590D;&#x4E60;&#x9898;&#x3002;&#x590D;&#x4E60;&#x9898;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x524D;&#x9762;&#x7684;&#x6750;&#x6599;&#xFF0C;&#x7B54;&#x6848;&#x90FD;&#x5F88;&#x7B80;&#x5355;&#x660E;&#x4E86;&#x3002;</p>
<p>&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x95EE;&#x9898;&#x51FA;&#x73B0;&#x5728;&#x6BCF;&#x7AE0;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5206;&#x4E3A;&#x7EC3;&#x4E60;&#x548C;&#x63A2;&#x7D22;&#x3002;&#x524D;&#x8005;&#x901A;&#x5E38;&#x6BD4;&#x6BCF;&#x8282;&#x540E;&#x7684;&#x590D;&#x4E60;&#x9898;&#x66F4;&#x5177;&#x6311;&#x6218;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x8BFE;&#x540E;&#x4F5C;&#x4E1A;&#x6216;&#x5C0F;&#x9879;&#x76EE;&#x3002;&#x540E;&#x8005;&#x66F4;&#x5177;&#x5F00;&#x653E;&#x6027;&#xFF0C;&#x9700;&#x8981;&#x67E5;&#x9605;&#x7F51;&#x7EDC;&#x8D44;&#x6599;&#x6216;&#x56FE;&#x4E66;&#x9986;&#x3001;&#x6295;&#x5165;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x5F97;&#x5230;&#x7B54;&#x6848;&#x3002;&#x8BB8;&#x591A;&#x7EC3;&#x4E60;&#xFF08;&#x4E0D;&#x662F;&#x63A2;&#x7D22;&#xFF09;&#x7B54;&#x6848;&#x90FD;&#x53EF;&#x4EE5;&#x5728;<a href="textbooks.elsevier.com/web/9780124104099">&#x8FD9;&#x91CC;</a>&#x6CE8;&#x518C;&#x540E;&#x83B7;&#x53D6;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x672C;&#x4E66;">&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x672C;&#x4E66;</h2>
<p>&#x672C;&#x4E66;&#x51E0;&#x4E4E;&#x6DB5;&#x76D6;&#x4E86;Computing Curricula 2013 report[SR13]&#x4E2D;&#x6240;&#x6709;&#x5173;&#x4E8E;PL&#x7684;&#x5185;&#x5BB9;&#x3002;&#x672C;&#x4E66;&#x662F;&#x4E3A;&#x7F57;&#x5207;&#x65AF;&#x7279;&#x5927;&#x5B66;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x8BFE;&#x7A0B;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x62A5;&#x544A;&#x4E2D;&#xFF08;&#x7B2C;369-371&#x9875;&#xFF09;&#x7684;&#x201C;&#x8303;&#x4F8B;&#x8BFE;&#x7A0B;&#x201D;&#x4E4B;&#x4E00;&#x3002;&#x56FE;1&#x5C55;&#x793A;&#x4E86;&#x672C;&#x4E66;&#x53EF;&#x80FD;&#x7684;&#x51E0;&#x79CD;&#x6559;&#x5B66;&#x89C4;&#x5212;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x81EA;&#x5B66;&#x6216;&#x5168;&#x5E74;&#x8BFE;&#x7A0B;&#xFF08;&#x56FE;1&#x4E2D;&#x7684;F&#xFF09;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x6559;&#x6388;&#x672C;&#x4E66;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x201C;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x201D;&#x90E8;&#x5206;&#xFF0C;&#x53C2;&#x8003;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x4E0A;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x7F57;&#x5207;&#x65AF;&#x7279;&#x5927;&#x5B66;&#x7684;&#x4E00;&#x5B66;&#x671F;&#x8BFE;&#x7A0B;&#xFF08;R&#xFF09;&#x4E5F;&#x6DB5;&#x76D6;&#x4E86;&#x672C;&#x4E66;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5305;&#x542B;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x4E5F;&#x4E0D;&#x5305;&#x62EC;&#x81EA;&#x4E0B;&#x800C;&#x4E0A;&#x7684;&#x89E3;&#x6790;&#xFF08;2.3.4&#xFF09;&#x3001;&#x903B;&#x8F91;&#x8BED;&#x8A00;&#xFF08;&#x7B2C;12&#x7AE0;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x7B2C;15&#x7AE0;&#xFF08;&#x6784;&#x5EFA;&#x53EF;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#xFF09;&#x548C;&#x7B2C;16&#x7AE0;&#xFF08;&#x8FD0;&#x884C;&#x65F6;&#x7A0B;&#x5E8F;&#x7BA1;&#x7406;&#xFF09;&#x7684;&#x540E;&#x534A;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3002;&#x7279;&#x522B;&#x6CE8;&#x610F;&#xFF0C;&#x6709;&#x5173;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x5185;&#x5BB9;&#xFF08;&#x7279;&#x522B;&#x662F;&#x7B2C;11&#x7AE0;&#xFF09;&#x53EF;&#x4EE5;&#x7528;OCaml&#x6216;Scheme&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x6559;&#x5B66;&#x3002;</p>
<p>&#x4E00;&#x4E9B;&#x7AE0;&#x8282;&#xFF08;&#x7B2C;2&#x3001;4&#x3001;5&#x3001;15&#x3001;16&#x3001;17&#x7AE0;&#xFF09;&#x6BD4;&#x5176;&#x5B83;&#x7AE0;&#x8282;&#x66F4;&#x5F3A;&#x8C03;&#x5B9E;&#x73B0;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x8FD9;&#x4E9B;&#x7AE0;&#x8282;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x4EE5;&#x4F5C;&#x4E3A;&#x9762;&#x5411;&#x8BBE;&#x8BA1;&#x7684;&#x7AE0;&#x8282;&#x7684;&#x6269;&#x5C55;&#x3002;&#x4FEE;&#x8BFB;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x7EC4;&#x7EC7;&#x8BFE;&#x7A0B;&#x5B66;&#x751F;&#x5F88;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x719F;&#x6089;&#x4E86;&#x7B2C;5&#x7AE0;&#x4E2D;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E00;&#x7AE0;&#x88AB;&#x653E;&#x5728;&#x4E86;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x4E0A;&#x3002;&#x4FEE;&#x8BFB;&#x8FC7;&#x81EA;&#x52A8;&#x673A;&#x7406;&#x8BBA;&#x8BFE;&#x7A0B;&#x7684;&#x5B66;&#x751F;&#x4E5F;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x719F;&#x6089;&#x4E86;&#x7B2C;2&#x7AE0;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5185;&#x5BB9;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x7AE0;&#x8282;&#xFF0C;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x9605;&#x8BFB;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x636E;&#x6B64;&#x8BA8;&#x8BBA;&#x4E00;&#x4E9B;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x5982;&#x4F55;&#x4ECE;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x4E2D;&#x6062;&#x590D;&#xFF0C;&#x6216;&#x8005;&#x626B;&#x63CF;&#x5668;&#x4E0E;&#x7ECF;&#x5178;&#x6709;&#x9650;&#x81EA;&#x52A8;&#x673A;&#x7684;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x8BFE;&#x7A0B;&#xFF08;&#x56FE;1&#x4E2D;&#x7684;P&#xFF09;&#x53EF;&#x80FD;&#x4F1A;&#x7701;&#x7565;&#x5173;&#x4E8E;&#x626B;&#x63CF;&#x548C;&#x89E3;&#x6790;&#xFF0C;&#x4EE5;&#x53CA;&#x7B2C;4&#x7AE0;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#xFF0C;&#x8FD8;&#x53EF;&#x80FD;&#x4ECE;&#x6574;&#x4F53;&#x4E0A;&#x6DE1;&#x5316;&#x5B9E;&#x73B0;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x4E2D;&#x9762;&#x5411;&#x8BBE;&#x8BA1;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5982;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#xFF08;10.6&#xFF09;&#x3001;Smalltalk&#xFF08;10.7.1&#xFF09;&#x3001;lambda&#x6F14;&#x7B97;&#xFF08;11.7&#xFF09;&#x548C;&#x8C13;&#x8BCD;&#x6F14;&#x7B97;&#xFF08;12.3&#xFF09;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x8FD8;&#x88AB;&#x4E00;&#x4E9B;&#x5B66;&#x6821;&#x7528;&#x4E8E;&#x7F16;&#x8BD1;&#x5668;&#x5165;&#x95E8;&#x8BFE;&#x7A0B;&#xFF08;&#x56FE;1&#x4E2D;&#x7684;C&#xFF09;&#x3002;&#x5178;&#x578B;&#x7684;&#x6559;&#x5B66;&#x5927;&#x7EB2;&#x7701;&#x7565;&#x4E86;&#x7B2C;3&#x90E8;&#x5206;&#xFF08;&#x7B2C;11&#x7AE0;&#x81F3;&#x7B2C;14&#x7AE0;&#xFF09;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x5E76;&#x4ECE;&#x6574;&#x4F53;&#x4E0A;&#x6DE1;&#x5316;&#x4E86;&#x8BBE;&#x8BA1;&#x65B9;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5B83;&#x8FD8;&#x5305;&#x62EC;&#x6240;&#x6709;&#x5173;&#x4E8E;&#x626B;&#x63CF;&#x548C;&#x89E3;&#x6790;&#x3001;&#x7B2C;15&#x7AE0;&#x5230;&#x7B2C;17&#x7AE0;&#xFF0C;&#x4EE5;&#x53CA;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x4E2D;&#x7684;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E00;&#x95E8;&#x534A;&#x5B66;&#x671F;&#x7684;&#x5BFC;&#x8BBA;&#x8BFE;&#x7A0B;&#x548C;&#x4E24;&#x95E8;&#x534A;&#x5B66;&#x671F;&#x7684;&#x53EF;&#x9009;&#x540E;&#x7EED;&#x8BFE;&#x7A0B;&#xFF08;&#x56FE;1&#x4E2D;&#x7684;Q&#xFF09;&#x3002;&#x5BFC;&#x8BBA;&#x8BFE;&#x7A0B;&#x53EF;&#x80FD;&#x6DB5;&#x76D6;&#x7B2C;1&#x3001;3&#x3001;6&#x3001;7&#x548C;8&#x7AE0;&#x7684;&#x4E3B;&#x8981;&#xFF08;&#x975E;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#xFF09;&#x5185;&#x5BB9;&#xFF0C;&#x4EE5;&#x53CA;&#x7B2C;2&#x548C;&#x7B2C;9&#x7AE0;&#x7684;&#x524D;&#x534A;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3002;&#x9762;&#x5411;&#x8BED;&#x8A00;&#x7684;&#x540E;&#x7EED;&#x8BFE;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x6DB5;&#x76D6;&#x7B2C;9&#x7AE0;&#x7684;&#x540E;&#x534A;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3001;&#x7B2C;3&#x90E8;&#x5206;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x3001;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x4E2D;&#x7B2C;6&#x7AE0;&#x5230;&#x7B2C;9&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8FD8;&#x6709;&#x5173;&#x4E8E;&#x5F62;&#x5F0F;&#x8BED;&#x4E49;&#x5B66;&#x3001;&#x7C7B;&#x578B;&#x7406;&#x8BBA;&#x6216;&#x5176;&#x5B83;&#x76F8;&#x5173;&#x4E3B;&#x9898;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x9762;&#x5411;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x540E;&#x7EED;&#x8BFE;&#x7A0B;&#x53EF;&#x80FD;&#x6DB5;&#x76D6;&#x7B2C;2&#x7AE0;&#x7684;&#x540E;&#x534A;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x7B2C;4-5&#x7AE0;&#x548C;&#x7B2C;15-17&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x4E2D;&#x7B2C;3&#x7AE0;&#x548C;&#x7B2C;9-10&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8FD8;&#x6709;&#x5173;&#x4E8E;&#x81EA;&#x52A8;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x3001;&#x79EF;&#x6781;&#x7684;&#x4EE3;&#x7801;&#x6539;&#x8FDB;&#xFF08;aggressive code improvement&#xFF09;&#x3001;&#x7F16;&#x7A0B;&#x5DE5;&#x5177;&#x7B49;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x65E0;&#x8BBA;&#x4EE5;&#x4F55;&#x79CD;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x672C;&#x4E66;&#xFF0C;&#x6211;&#x90FD;&#x5047;&#x8BBE;&#x8BFB;&#x8005;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x4E86;&#x81F3;&#x5C11;&#x4E00;&#x79CD;&#x547D;&#x4EE4;&#x5F0F;&#x8BED;&#x8A00;&#x3002;&#x5177;&#x4F53;&#x662F;&#x54EA;&#x79CD;&#x8BED;&#x8A00;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x793A;&#x4F8B;&#x6765;&#x81EA;&#x591A;&#x79CD;&#x8BED;&#x8A00;&#xFF0C;&#x5E76;&#x914D;&#x6709;&#x8BE6;&#x7EC6;&#x7684;&#x6CE8;&#x91CA;&#x548C;&#x8BA8;&#x8BBA;&#xFF0C;&#x6CA1;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x8BFB;&#x8005;&#x4E5F;&#x80FD;&#x591F;&#x8F7B;&#x677E;&#x7406;&#x89E3;&#x3002;&#x5173;&#x4E8E;&#x8FD9;60&#x591A;&#x79CD;&#x8BED;&#x8A00;&#x7684;&#x4ECB;&#x7ECD;&#x89C1;&#x9644;&#x5F55;A&#x3002;&#x7B97;&#x6CD5;&#x4EE5;&#x4F2A;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#x5448;&#x73B0;&#xFF0C;&#x4E14;&#x662F;&#x81EA;&#x6D3D;&#x7684;&#x3002;&#x4EE3;&#x7801;&#x4F7F;&#x7528;&#x201C;&#x6253;&#x5B57;&#x673A;&#xFF08;typewriter&#xFF09;&#x201D;&#x5B57;&#x4F53;&#xFF0C;&#x4F2A;&#x4EE3;&#x7801;&#x4F7F;&#x7528;&#x4E3A;&#x65E0;&#x886C;&#x7EBF;&#xFF08;sans-serif&#xFF09;&#x5B57;&#x4F53;&#x3002;</p>
<h2 id="&#x8865;&#x5145;&#x6750;&#x6599;">&#x8865;&#x5145;&#x6750;&#x6599;</h2>
<p>&#x9664;&#x4E86;&#x8865;&#x5145;&#x5185;&#x5BB9;&#x5916;&#xFF0C;&#x914D;&#x5957;&#x7F51;&#x7AD9;&#x8FD8;&#x5305;&#x542B;&#x6240;&#x6709;&#x793A;&#x4F8B;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x53CA;&#x672C;&#x4E66;&#x7684;&#x52D8;&#x8BEF;&#x8868;&#x3002;&#x66F4;&#x591A;&#x8D44;&#x6E90;&#x53EF;&#x5728;<a href="textbooks.elsevier.com/web/9780124104099">&#x8FD9;&#x91CC;</a>&#x83B7;&#x53D6;&#x3002;&#x5BF9;&#x4E8E;&#x5DF2;&#x4F7F;&#x7528;&#x672C;&#x4E66;&#x7684;&#x6559;&#x5E08;&#xFF0C;&#x6CE8;&#x518C;&#x540E;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x7684;&#x8D44;&#x6E90;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x4E66;&#x4E2D;&#x6240;&#x6709;&#x63D2;&#x56FE;&#x7684;pdf&#x6587;&#x4EF6;</li>
<li>&#x6559;&#x5B66;PPT</li>
<li>&#x7EC3;&#x4E60;&#x9898;&#x7B54;&#x6848;</li>
<li>&#x9879;&#x76EE;&#x7684;&#x76F8;&#x5173;&#x5EFA;&#x8BAE;</li>
</ul>
<h2 id="&#x81F4;&#x8C22;">&#x81F4;&#x8C22;</h2>
<p>Michael L. Scott</p>
<p>Rochester, NY</p>
<p>August 2015</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="foreword.html" class="navigation navigation-prev " aria-label="Previous page: 序言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="part1/" class="navigation navigation-next " aria-label="Next page: 第1部分 基础">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"前言","level":"1.3","depth":1,"next":{"title":"第1部分 基础","level":"1.4","depth":1,"path":"part1/README.md","ref":"part1/README.md","articles":[{"title":"第1章 绪论","level":"1.4.1","depth":2,"path":"part1/ch1/README.md","ref":"part1/ch1/README.md","articles":[{"title":"1.1 程序设计语言设计的艺术","level":"1.4.1.1","depth":3,"path":"part1/ch1/1-1.md","ref":"part1/ch1/1-1.md","articles":[]},{"title":"1.2 程序设计语言族谱","level":"1.4.1.2","depth":3,"path":"part1/ch1/1-2.md","ref":"part1/ch1/1-2.md","articles":[]},{"title":"1.3 为什么学习程序设计语言","level":"1.4.1.3","depth":3,"path":"part1/ch1/1-3.md","ref":"part1/ch1/1-3.md","articles":[]},{"title":"1.4 编译器和解释器","level":"1.4.1.4","depth":3,"path":"part1/ch1/1-4.md","ref":"part1/ch1/1-4.md","articles":[]},{"title":"1.5 编程环境","level":"1.4.1.5","depth":3,"path":"part1/ch1/1-5.md","ref":"part1/ch1/1-5.md","articles":[]}]}]},"previous":{"title":"序言","level":"1.2","depth":1,"path":"foreword.md","ref":"foreword.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"descrption":"Programming Language Pragmatics Fourth Edtion 中文版","theme":"default","author":"Michael L. Scott","margin":{"right":30,"left":30,"top":30,"bottom":50},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"978-0-12-410409-9","variables":{},"title":"程序设计语言 实践之路（第四版）","language":"zh-hans","gitbook":"*","direction":"ltr"},"file":{"path":"preface.md","mtime":"2022-06-27T15:41:12.095Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-06-27T15:41:17.520Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

