
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.1 程序设计语言设计的艺术 · 程序设计语言 实践之路（第四版）</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Michael L. Scott">
        <meta name="identifier" content="978-0-12-410409-9" scheme="ISBN">
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1-2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../foreword.html">
            
                <a href="../../foreword.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../../preface.html">
            
                <a href="../../preface.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../">
            
                <a href="../">
            
                    
                    第1部分 基础
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="./">
            
                <a href="./">
            
                    
                    第1章 绪论
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.4.1.1" data-path="1-1.html">
            
                <a href="1-1.html">
            
                    
                    1.1 程序设计语言设计的艺术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.2" data-path="1-2.html">
            
                <a href="1-2.html">
            
                    
                    1.2 程序设计语言族谱
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.3" data-path="1-3.html">
            
                <a href="1-3.html">
            
                    
                    1.3 为什么学习程序设计语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.4" data-path="1-4.html">
            
                <a href="1-4.html">
            
                    
                    1.4 编译器和解释器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.5" data-path="1-5.html">
            
                <a href="1-5.html">
            
                    
                    1.5 编程环境
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >1.1 程序设计语言设计的艺术</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="11-&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x7684;&#x827A;&#x672F;">1.1 &#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x7684;&#x827A;&#x672F;</h1>
<p>&#x5982;&#x4ECA;&#x6709;&#x6570;&#x5343;&#x79CD;&#x9AD8;&#x7EA7;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#xFF0C;&#x4E14;&#x65B0;&#x7684;&#x8BED;&#x8A00;&#x4E0D;&#x65AD;&#x6D8C;&#x73B0;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#xFF1F;&#x6709;&#x51E0;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x7B54;&#x6848;&#xFF1A;</p>
<ul>
<li><p><em>&#x6280;&#x672F;&#x6F14;&#x8FDB;</em>&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x662F;&#x4E00;&#x95E8;&#x5E74;&#x8F7B;&#x7684;&#x5B66;&#x79D1;&#xFF1B;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x5728;&#x5BFB;&#x627E;&#x66F4;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;20&#x4E16;&#x7EAA;60&#x5E74;&#x4EE3;&#x672B;&#x548C;70&#x5E74;&#x4EE3;&#x521D;&#x53D1;&#x751F;&#x4E86;&#x4E00;&#x573A;&#x201C;&#x7ED3;&#x6784;&#x5316;&#x7F16;&#x7A0B;&#x201D;&#x7684;&#x9769;&#x547D;&#xFF0C;&#x5176;&#x4E2D;&#x57FA;&#x4E8E;<code>goto</code>&#x63A7;&#x5236;&#x6D41;&#x7684;Fortran&#x3001;Cobol&#x548C;Basic<sup><a href="#fn_3" id="reffn_3">3</a></sup>&#x7B49;&#x8BED;&#x8A00;&#x88AB;<code>while</code>&#x5FAA;&#x73AF;&#x3001;<code>case</code>&#xFF08;<code>switch</code>&#xFF09;&#x8BED;&#x53E5;&#x548C;&#x7C7B;&#x4F3C;&#x7684;&#x9AD8;&#x7EA7;&#x7ED3;&#x6784;&#x6240;&#x53D6;&#x4EE3;&#x3002;20&#x4E16;&#x7EAA;80&#x5E74;&#x4EE3;&#x672B;&#xFF0C;&#x5D4C;&#x5957;&#x5757;&#x7ED3;&#x6784;&#x7684;Algol&#x3001;Pascal&#x548C;Ada&#x7B49;&#x8BED;&#x8A00;&#x7684;&#x5F00;&#x59CB;&#x8BA9;&#x4F4D;&#x7ED9;Smalltalk&#x3001;C++&#x3001;Eiffel&#x7B49;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4EE5;&#x53CA;&#x5341;&#x5E74;&#x540E;&#x7684;Java&#x548C;C#&#x3002;&#x4E3A;&#x4E86;&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#xFF0C;&#x6700;&#x8FD1;Python&#x548C;Ruby&#x7B49;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x5F00;&#x59CB;&#x53D6;&#x4EE3;&#x66F4;&#x4F20;&#x7EDF;&#x7684;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#x3002;</p>
</li>
<li><p><em>&#x7279;&#x6B8A;&#x7528;&#x9014;</em>&#x3002;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x662F;&#x4E3A;&#x7279;&#x5B9A;&#x7684;&#x95EE;&#x9898;&#x57DF;&#x8BBE;&#x8BA1;&#x7684;&#xFF1A;&#x5404;&#x79CD;Lisp&#x65B9;&#x8A00;&#x90FD;&#x9002;&#x5408;&#x5904;&#x7406;&#x7B26;&#x53F7;&#x6570;&#x636E;&#x548C;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1B;Icon&#x548C;Awk&#x5F88;&#x9002;&#x5408;&#x5904;&#x7406;&#x5B57;&#x7B26;&#x4E32;&#xFF1B;C&#x8BED;&#x8A00;&#x9002;&#x7528;&#x4E8E;&#x5E95;&#x5C42;&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#xFF1B;Prolog&#x5F88;&#x9002;&#x5408;&#x4E8E;&#x63A8;&#x7406;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x7684;&#x903B;&#x8F91;&#x5173;&#x7CFB;&#x3002;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x79CD;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F46;&#x91CD;&#x70B9;&#x663E;&#x7136;&#x662F;&#x4E13;&#x4E1A;&#x6027;&#x3002;</p>
</li>
<li><p><em>&#x4E2A;&#x4EBA;&#x559C;&#x597D;</em>&#x3002;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x559C;&#x6B22;&#x4E0D;&#x540C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x7F16;&#x7A0B;&#x7684;&#x72ED;&#x9698;&#x6027;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x54C1;&#x5473;&#x95EE;&#x9898;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x559C;&#x6B22;C&#x7684;&#x7B80;&#x6D01;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E9B;&#x4EBA;&#x8BA8;&#x538C;&#x5B83;&#xFF1B;&#x6709;&#x4E9B;&#x4EBA;&#x89C9;&#x5F97;&#x9012;&#x5F52;&#x601D;&#x8003;&#x5F88;&#x81EA;&#x7136;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E9B;&#x4EBA;&#x66F4;&#x559C;&#x6B22;&#x8FED;&#x4EE3;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x559C;&#x6B22;&#x4F7F;&#x7528;&#x6307;&#x9488;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E9B;&#x4EBA;&#x66F4;&#x559C;&#x6B22;Lisp&#x3001;Java&#x548C;ML&#x4E2D;&#x7684;&#x9690;&#x5F0F;&#x89E3;&#x5F15;&#x7528;&#x3002;&#x4E2A;&#x4EBA;&#x504F;&#x597D;&#x7684;&#x7A0B;&#x5EA6;&#x548C;&#x591A;&#x6837;&#x6027;&#x4F7F;&#x5F97;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x4E0D;&#x53EF;&#x80FD;&#x5F00;&#x53D1;&#x51FA;&#x4E00;&#x79CD;&#x666E;&#x904D;&#x63A5;&#x53D7;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;</p>
</li>
</ul>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x6BD4;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x66F4;&#x6210;&#x529F;&#x3002;&#x5728;&#x5DF2;&#x7ECF;&#x8BBE;&#x8BA1;&#x7684;&#x8BB8;&#x591A;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x51E0;&#x5341;&#x79CD;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x662F;&#x4EC0;&#x4E48;&#x8BA9;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x6210;&#x529F;&#x5462;&#xFF1F;&#x540C;&#x6837;&#xFF0C;&#x4E5F;&#x6709;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7B54;&#x6848;&#xFF1A;</p>
<ul>
<li><p><em>&#x8868;&#x8FBE;&#x80FD;&#x529B;</em>&#x3002;&#x4EBA;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x542C;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x8BBA;&#x70B9;&#xFF0C;&#x5373;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x6BD4;&#x53E6;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x66F4;&#x201C;&#x5F3A;&#x5927;&#x201D;&#xFF0C;&#x5C3D;&#x7BA1;&#x5728;&#x5F62;&#x5F0F;&#x4E0A;&#x7684;&#x6570;&#x5B66;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6BCF;&#x79CD;&#x8BED;&#x8A00;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x4EFB;&#x610F;&#x7B97;&#x6CD5;&#xFF0C;&#x5373;&#x4F7F;&#x53EF;&#x80FD;&#x5F88;&#x7B28;&#x62D9;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x5BF9;&#x7A0B;&#x5E8F;&#x5458;&#x7F16;&#x5199;&#x6E05;&#x6670;&#x3001;&#x7B80;&#x6D01;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x4EE3;&#x7801;&#x6709;&#x7740;&#x5DE8;&#x5927;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E8E;&#x975E;&#x5E38;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x65E9;&#x671F;&#x7684;Basic&#x4E0E;C++&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x53EF;&#x6BD4;&#x6027;&#x3002;&#x8BED;&#x8A00;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x7684;&#x5F3A;&#x5F31;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x62BD;&#x8C61;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x7684;&#x5F3A;&#x5F31;&#xFF0C;&#x662F;&#x672C;&#x4E66;&#x7684;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x70B9;&#x3002;</p>
</li>
<li><p><em>&#x5B66;&#x4E60;&#x66F2;&#x7EBF;</em>&#x3002;&#x867D;&#x7136;&#x5F88;&#x5BB9;&#x6613;&#x9009;&#x62E9;Basic&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x5426;&#x8BA4;&#x5B83;&#x7684;&#x6210;&#x529F;&#x3002;&#x8FD9;&#x79CD;&#x6210;&#x529F;&#x7684;&#x90E8;&#x5206;&#x539F;&#x56E0;&#x662F;&#x5B83;&#x7684;&#x201C;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x201D;&#x5F88;&#x4F4E;&#x3002;&#x957F;&#x4E45;&#x4EE5;&#x6765;&#xFF0C;&#x4F7F;&#x7528;Pascal&#x4F5C;&#x4E3A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5165;&#x95E8;&#x8BFE;&#x7A0B;&#x662F;&#x56E0;&#x4E3A;&#x81F3;&#x5C11;&#x4E0E;&#x5176;&#x5B83;&#x201C;&#x4E25;&#x8083;&#x201D;&#x8BED;&#x8A00;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x7D27;&#x51D1;&#x4E14;&#x6613;&#x4E8E;&#x5B66;&#x4E60;&#x3002;&#x4E16;&#x7EAA;&#x4E4B;&#x4EA4;&#x540E;&#x4E0D;&#x4E45;&#xFF0C;Java&#x5F00;&#x59CB;&#x626E;&#x6F14;&#x7C7B;&#x4F3C;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x867D;&#x7136;&#x5B9E;&#x9645;&#x4E0A;&#x6BD4;Pascal&#x66F4;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x5B83;&#x6BD4;C++&#x66F4;&#x7B80;&#x5355;&#x3002;&#x4E3A;&#x4E86;&#x91CD;&#x65B0;&#x8FFD;&#x6C42;&#x7B80;&#x5355;&#x6027;&#xFF0C;&#x8FD1;&#x5E74;&#x6765;&#x4E00;&#x4E9B;&#x5165;&#x95E8;&#x8BFE;&#x7A0B;&#x8F6C;&#x5411;&#x4E86;Python&#x7B49;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x3002;</p>
</li>
<li><p><em>&#x5B9E;&#x73B0;&#x96BE;&#x6613;</em>&#x3002;&#x9664;&#x4E86;&#x5B83;&#x7684;&#x4F4E;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x5916;&#xFF0C;Basic&#x4E4B;&#x6240;&#x4EE5;&#x6210;&#x529F;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x8D44;&#x6E90;&#x6709;&#x9650;&#x7684;&#x5C0F;&#x578B;&#x673A;&#x5668;&#x4E0A;&#x8F7B;&#x677E;&#x5B9E;&#x73B0;&#x3002;&#x51FA;&#x4E8E;&#x7C7B;&#x4F3C;&#x7684;&#x539F;&#x56E0;&#xFF0C;Forth&#x6709;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x5FE0;&#x5B9E;&#x7684;&#x8FFD;&#x968F;&#x8005;&#x3002;Pascal&#x6210;&#x529F;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x56E0;&#x7D20;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x5176;&#x8BBE;&#x8BA1;&#x8005;Niklaus Wirth&#x5F00;&#x53D1;&#x4E86;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x3001;&#x53EF;&#x79FB;&#x690D;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x514D;&#x8D39;&#x63D0;&#x4F9B;&#x7ED9;&#x4E16;&#x754C;&#x5404;&#x5730;&#x7684;&#x5927;&#x5B66;&#xFF08;&#x53C2;&#x89C1;&#x793A;EXAMPLE 1.15&#xFF09;<sup><a href="#fn_4" id="reffn_4">4</a></sup>&#x3002;Java&#x548C;Python&#x8BBE;&#x8BA1;&#x8005;&#x91C7;&#x53D6;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;&#x8BED;&#x8A00;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x514D;&#x8D39;&#x63D0;&#x4F9B;&#x7ED9;&#x4EFB;&#x4F55;&#x4EBA;&#x3002;</p>
</li>
<li><p><em>&#x8BED;&#x8A00;&#x6807;&#x51C6;</em>&#x3002;&#x51E0;&#x4E4E;&#x6BCF;&#x4E00;&#x79CD;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x8A00;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5B98;&#x65B9;&#x7684;&#x56FD;&#x9645;&#x6807;&#x51C6;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x89C4;&#x8303;&#x5316;&#x7684;&#x5B9E;&#x73B0;&#xFF08;&#x5BF9;&#x4E8E;&#x51E0;&#x79CD;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x800C;&#x8A00;&#xFF09;&#xFF0C;&#x540E;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x89C4;&#x8303;&#x7684;&#x5316;&#x5B9E;&#x73B0;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x7528;&#x6709;&#x56FD;&#x9645;&#x6807;&#x51C6;&#x7684;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x3002;&#x8BED;&#x8A00;&#x548C;&#x5E93;&#x7684;&#x6807;&#x51C6;&#x5316;&#x662F;&#x786E;&#x4FDD;&#x4EE3;&#x7801;&#x8DE8;&#x5E73;&#x53F0;&#x548C;&#x53EF;&#x79FB;&#x690D;&#x7684;&#x552F;&#x4E00;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x3002;Pascal&#x7684;&#x6807;&#x51C6;&#x76F8;&#x5BF9;&#x8D2B;&#x4E4F;&#xFF0C;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x8BA4;&#x4E3A;&#x5176;&#x7F3A;&#x5C11;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x7279;&#x6027;&#xFF08;&#x5206;&#x79BB;&#x7F16;&#x8BD1;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x9759;&#x6001;&#x521D;&#x59CB;&#x5316;&#x3001;&#x968F;&#x673A;&#x8BBF;&#x95EE;I/O&#xFF09;&#xFF0C;&#x8FD9;&#x81F3;&#x5C11;&#x662F;&#x8BE5;&#x8BED;&#x8A00;&#x5728;20&#x4E16;&#x7EAA;80&#x5E74;&#x4EE3;&#x8D70;&#x5411;&#x6CA1;&#x843D;&#x7684;&#x90E8;&#x5206;&#x539F;&#x56E0;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x5382;&#x5546;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x3002;</p>
</li>
<li><p><em>&#x5F00;&#x6E90;</em>&#x3002;&#x5927;&#x591A;&#x6570;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7F16;&#x8BD1;&#x5668;&#x6216;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x4F46;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#xFF0C;&#x5C24;&#x5176;&#x662F;C&#x8BED;&#x8A00;&#xFF0C;&#x548C;&#x5176;&#x5B83;&#x81EA;&#x7531;&#x53D1;&#x5E03;&#x3001;&#x540C;&#x884C;&#x8BC4;&#x5BA1;&#x3001;&#x793E;&#x533A;&#x652F;&#x6301;&#x7684;&#x8BED;&#x8A00;&#x76F8;&#x6BD4;&#xFF0C;&#x4E0E;&#x5F00;&#x6E90;&#x7684;&#x8054;&#x7CFB;&#x66F4;&#x4E3A;&#x7D27;&#x5BC6;&#x3002;C&#x8BED;&#x8A00;&#x6700;&#x521D;&#x662F;&#x7531;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;<sup><a href="#fn_5" id="reffn_5">5</a></sup>&#x7684;Dennis Ritchie&#x548C;Ken Thompson&#x4E8E;20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x521D;&#x5728;&#x8BBE;&#x8BA1;Unix&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x65F6;&#x5F00;&#x53D1;&#x7684;&#x3002;&#x591A;&#x5E74;&#x6765;&#xFF0C;Unix&#x9010;&#x6E10;&#x53D1;&#x5C55;&#x6210;&#x4E3A;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x2014;&#x2014;&#x8BA1;&#x7B97;&#x673A;&#x5B66;&#x672F;&#x754C;&#x7684;&#x9996;&#x9009;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;C&#x8BED;&#x8A00;&#x4E5F;&#x4E00;&#x76F4;&#x4E0E;&#x4E4B;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x3002;&#x968F;&#x7740;C&#x8BED;&#x8A00;&#x7684;&#x6807;&#x51C6;&#x5316;&#xFF0C;&#x8BE5;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x5728;&#x5404;&#x79CD;&#x5E73;&#x53F0;&#x4E0A;&#x4F7F;&#x7528;&#xFF0C;&#x4F8B;&#x5982;&#x4E16;&#x754C;&#x9886;&#x5148;&#x7684;&#x5F00;&#x6E90;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;Linux&#x662F;&#x7528;C&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x3002;&#x622A;&#x81F3;2015&#x5E74;6&#x6708;&#xFF0C;C&#x8BED;&#x8A00;&#x53CA;&#x5176;&#x5B50;&#x7CFB;&#x7EDF;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x5360;&#x636E;&#x4E86;&#x4E0E;&#x8BED;&#x8A00;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x7684;&#x4E00;&#x534A;&#x4EE5;&#x4E0A;&#xFF0C;&#x5305;&#x62EC;&#x7F51;&#x9875;&#x5F15;&#x7528;&#x3001;&#x56FE;&#x4E66;&#x9500;&#x552E;&#x3001;&#x804C;&#x4F4D;&#x5217;&#x8868;&#x548C;&#x5F00;&#x6E90;&#x5B58;&#x50A8;&#x5E93;&#x66F4;&#x65B0;&#x3002;</p>
</li>
<li><p><em>&#x4F18;&#x79C0;&#x7684;&#x7F16;&#x8BD1;&#x5668;</em>&#x3002;Fortran&#x7684;&#x6210;&#x529F;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x5F52;&#x529F;&#x4E8E;&#x7F16;&#x8BD1;&#x5668;&#x3002;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5386;&#x53F2;&#x6027;&#x7684;&#x5076;&#x7136;&#x4E8B;&#x4EF6;&#x3002;Fortran&#x7684;&#x5B58;&#x5728;&#x65F6;&#x95F4;&#x6BD4;&#x4EFB;&#x4F55;&#x5176;&#x5B83;&#x8BED;&#x8A00;&#x90FD;&#x957F;&#xFF0C;&#x516C;&#x53F8;&#x6295;&#x5165;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x91D1;&#x94B1;&#x6765;&#x7F16;&#x5199;&#x80FD;&#x591F;&#x751F;&#x6210;&#x66F4;&#x5FEB;&#x4EE3;&#x7801;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x3002;&#x7136;&#x800C;&#x8FD9;&#x4E5F;&#x662F;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x7684;&#x95EE;&#x9898;&#xFF1A;Fortran 90&#x4E4B;&#x524D;&#x7684;&#x65B9;&#x8A00;&#x7F3A;&#x4E4F;&#x9012;&#x5F52;&#x548C;&#x6307;&#x9488;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x4F1A;&#x4F7F;&#x5F97;&#x751F;&#x6210;&#x5FEB;&#x901F;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x590D;&#x6742;&#xFF08;&#x81F3;&#x5C11;&#x5BF9;&#x4E8E;&#x6CA1;&#x6709;&#x9012;&#x5F52;&#x548C;&#x6307;&#x9488;&#x7684;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#x662F;&#x5982;&#x6B64;&#xFF01;&#xFF09;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x4E00;&#x4E9B;&#x8BED;&#x8A00;&#xFF08;&#x5982;Common Lisp&#xFF09;&#x4E4B;&#x6240;&#x4EE5;&#x6210;&#x529F;&#xFF0C;&#x90E8;&#x5206;&#x539F;&#x56E0;&#x662F;&#x5B83;&#x4EEC;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x5DE5;&#x5177;&#x94FE;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x5E2E;&#x52A9;&#x7A0B;&#x5E8F;&#x5458;&#x7BA1;&#x7406;&#x5927;&#x578B;&#x9879;&#x76EE;&#x3002;</p>
</li>
<li><p><em>&#x7ECF;&#x6D4E;&#x3001;&#x8D5E;&#x52A9;&#x548C;&#x60EF;&#x6027;</em>&#x3002;&#x9664;&#x4E86;&#x6280;&#x672F;&#x65B9;&#x9762;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x5B83;&#x56E0;&#x7D20;&#x5BF9;&#x8BED;&#x8A00;&#x7684;&#x6210;&#x529F;&#x6709;&#x5F88;&#x5927;&#x5F71;&#x54CD;&#x3002;&#x5F3A;&#x5927;&#x8D5E;&#x52A9;&#x5546;&#x7684;&#x652F;&#x6301;&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x3002;&#x8FD1;&#x4F3C;&#x6765;&#x8BF4;&#xFF0C;PL/I&#x7531;IBM&#x8D44;&#x52A9;&#xFF0C;Cobol&#x548C;Ada&#x7531;&#x7F8E;&#x56FD;&#x56FD;&#x9632;&#x90E8;&#x8D44;&#x52A9;&#x3002;C#&#x7531;&#x5FAE;&#x8F6F;&#x8D44;&#x52A9;&#x3002;&#x8FD1;&#x5E74;&#x6765;&#xFF0C;&#x4F5C;&#x4E3A;iPhone&#x548C;iPad&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5B98;&#x65B9;&#x8BED;&#x8A00;&#x7684;Objective-C&#x53D7;&#x5230;&#x4E86;&#x6781;&#x5927;&#x7684;&#x6B22;&#x8FCE;&#x3002;&#x5728;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x53E6;&#x4E00;&#x7AEF;&#xFF0C;&#x4E00;&#x4E9B;&#x8BED;&#x8A00;&#x5728;&#x6709;&#x4E86;&#x201C;&#x66F4;&#x597D;&#x201D;&#x7684;&#x66FF;&#x4EE3;&#x54C1;&#x540E;&#x4ECD;&#x7136;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x66F4;&#x6362;&#x5DF2;&#x7ECF;&#x5B89;&#x88C5;&#x7684;&#x8F6F;&#x4EF6;&#x548C;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x6210;&#x672C;&#x592A;&#x9AD8;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E16;&#x754C;&#x4E0A;&#x8BB8;&#x591A;&#x91D1;&#x878D;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4ECD;&#x7136;&#x4F7F;&#x7528;Cobol&#x3002;</p>
</li>
</ul>
<p>&#x663E;&#x7136;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5355;&#x4E00;&#x56E0;&#x7D20;&#x51B3;&#x5B9A;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x662F;&#x597D;&#x662F;&#x574F;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4ECE;&#x591A;&#x4E2A;&#x89D2;&#x5EA6;&#x8003;&#x8651;&#x95EE;&#x9898;&#x3002;&#x7279;&#x522B;&#x662F;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4ECE;&#x7A0B;&#x5E8F;&#x5458;&#x548C;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x4E24;&#x65B9;&#x9762;&#x8003;&#x8651;&#x3002;&#x6709;&#x65F6;&#x8FD9;&#x4E24;&#x65B9;&#x9762;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x4E0A;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x5E38;&#x4F1A;&#x6709;&#x51B2;&#x7A81;&#x548C;&#x6743;&#x8861;&#xFF0C;&#x56E0;&#x4E3A;&#x529F;&#x80FD;&#x4E0E;&#x5176;&#x5B9E;&#x73B0;&#x6210;&#x672C;&#x662F;&#x5E73;&#x8861;&#x7684;&#x3002;&#x5F53;&#x5B9E;&#x73B0;&#x4E0D;&#x4EC5;&#x5BF9;&#x4F7F;&#x7528;&#x8BE5;&#x529F;&#x80FD;&#x7684;&#x7A0B;&#x5E8F;&#x589E;&#x52A0;&#x6210;&#x672C;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;&#x4E0D;&#x4F7F;&#x7528;&#x8BE5;&#x529F;&#x80FD;&#x7684;&#x7A0B;&#x5E8F;&#x4E5F;&#x589E;&#x52A0;&#x6210;&#x672C;&#x65F6;&#xFF0C;&#x6743;&#x8861;&#x53D8;&#x5F97;&#x5C24;&#x4E3A;&#x68D8;&#x624B;&#x3002;</p>
<p>&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x53D1;&#x5C55;&#x7684;&#x65E9;&#x671F;&#xFF0C;&#x5B9E;&#x73B0;&#x8005;&#x7684;&#x89C2;&#x70B9;&#x5360;&#x4E3B;&#x5BFC;&#x5730;&#x4F4D;&#xFF1A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x662F;&#x4F5C;&#x4E3A;&#x544A;&#x8BC9;&#x8BA1;&#x7B97;&#x673A;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x7684;&#x4E00;&#x79CD;&#x624B;&#x6BB5;&#x53D1;&#x5C55;&#x8D77;&#x6765;&#x7684;&#x3002;&#x7136;&#x800C;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x8BED;&#x8A00;&#x662F;&#x8868;&#x8FBE;&#x7B97;&#x6CD5;&#x7684;&#x4E00;&#x79CD;&#x624B;&#x6BB5;&#x3002;&#x6B63;&#x5982;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x9650;&#x5236;&#x4E86;&#x9610;&#x8FF0;&#x548C;&#x8BBA;&#x8FF0;&#x4E00;&#x6837;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x4E5F;&#x9650;&#x5236;&#x4E86;&#x53EF;&#x4EE5;&#x548C;&#x4E0D;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x8868;&#x8FBE;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5E76;&#x5BF9;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x4EA7;&#x751F;&#x4E86;&#x6DF1;&#x523B;&#x800C;&#x5FAE;&#x5999;&#x7684;&#x5F71;&#x54CD;&#x3002;Donald Knuth&#x66FE;&#x5EFA;&#x8BAE;&#xFF0C;&#x7F16;&#x7A0B;&#x5E94;&#x88AB;&#x89C6;&#x4E3A;&#x4E00;&#x95E8;&#x544A;&#x8BC9;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x5E0C;&#x671B;&#x8BA1;&#x7B97;&#x673A;&#x505A;&#x4EC0;&#x4E48;&#x7684;&#x4E8B;&#x60C5;[Knu84]<sup><a href="#fn_6" id="reffn_6">6</a></sup>&#x3002;&#x8FD9;&#x4E00;&#x5B9A;&#x4E49;&#x53EF;&#x80FD;&#x662F;&#x6700;&#x597D;&#x7684;&#x6298;&#x8877;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x627F;&#x8BA4;&#x6982;&#x5FF5;&#x7684;&#x6E05;&#x6670;&#x6027;&#x548C;&#x5B9E;&#x65BD;&#x6548;&#x7387;&#x90FD;&#x662F;&#x6839;&#x672C;&#x95EE;&#x9898;&#x3002;&#x672C;&#x4E66;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x540C;&#x65F6;&#x8003;&#x8651;&#x6982;&#x5FF5;&#x548C;&#x5B9E;&#x65BD;&#x65B9;&#x9762;&#x6DB5;&#x76D6;&#x7684;&#x6BCF;&#x4E2A;&#x4E3B;&#x9898;&#x6765;&#x9610;&#x8FF0;&#x8FD9;&#x79CD;&#x6298;&#x8877;&#x601D;&#x60F3;&#x3002;</p>
<blockquote>
<p>DESIGN &amp; IMPLEMENTATION 1.1 Introduction</p>
<p>Throughout the book, sidebars like this one will highlight the interplay of language design and language implementation. Among other things, we will consider</p>
<ul>
<li><p>Cases (such as those mentioned in this section) in which ease or difficulty of implementation significantly affected the success of a language</p>
</li>
<li><p>Language features that many designers now believe were mistakes, at least in part because of implementation difficulties</p>
</li>
<li><p>Potentially useful features omitted from some languages because of concern that they might be too difficult or slow to implement</p>
</li>
<li><p>Language features introduced at least in part to facilitate efficient or elegant implementations</p>
</li>
<li><p>Cases in which a machine architecture makes reasonable features unreasonably expensive</p>
</li>
<li><p>Various other tradeoffs in which implementation plays a significant role</p>
</li>
</ul>
</blockquote>
<blockquote id="fn_4">
<sup>4</sup>. Niklaus Wirth&#xFF08;1934&#x2013;&#xFF09;&#xFF0C;&#x745E;&#x58EB;&#x82CF;&#x9ECE;&#x4E16;ETH&#x4FE1;&#x606F;&#x5B66;&#x540D;&#x8A89;&#x6559;&#x6388;&#xFF0C;&#x957F;&#x65F6;&#x95F4;&#x7EF4;&#x62A4;&#x4E00;&#x7CFB;&#x5217;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5305;&#x62EC;Euler&#x3001;Algol W&#x3001;Pascal&#x3001;Modula&#x3001;Modula-2&#x548C;Oberon&#x3002;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x5F15;&#x5165;&#x4E86;&#x679A;&#x4E3E;&#x3001;&#x5B50;&#x8303;&#x56F4;&#x548C;&#x96C6;&#x5408;&#x7C7B;&#x578B;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x7EDF;&#x4E00;&#x4E86;&#x8BB0;&#x5F55;&#xFF08;&#x7ED3;&#x6784;&#xFF09;&#x548C;&#x53D8;&#x4F53;&#xFF08;&#x8054;&#x5408;&#xFF09;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x4ED6;&#x5728;1984&#x5E74;&#x83B7;&#x5F97;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6700;&#x9AD8;&#x8363;&#x8A89;&#x2014;&#x2014;&#x5E74;&#x5EA6;ACM&#x56FE;&#x7075;&#x5956;&#x3002;<a href="#reffn_4" title="Jump back to footnote [4] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_5">
<sup>5</sup>. Ken Thompson&#xFF08;1943&#x2013;&#xFF09;&#x9886;&#x5BFC;&#x4E86;Unix&#x7684;&#x5F00;&#x53D1;&#x3002;&#x4ED6;&#x8FD8;&#x8BBE;&#x8BA1;&#x4E86;B&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#xFF0C;&#x4E00;&#x79CD;BCPL&#x7684;&#x5B50;&#x8BED;&#x8A00;&#xFF0C;&#x4E5F;&#x662F;C&#x8BED;&#x8A00;&#x7684;&#x7236;&#x8BED;&#x8A00;&#x3002;Dennis Ritchie&#xFF08;1941-2011&#xFF09;&#x662F;C&#x8BED;&#x8A00;&#x53D1;&#x5C55;&#x80CC;&#x540E;&#x7684;&#x4E3B;&#x8981;&#x529B;&#x91CF;&#x3002;Thompson&#x548C;Ritchie&#x662F;&#x4E00;&#x4E2A;&#x6781;&#x5177;&#x751F;&#x4EA7;&#x529B;&#x548C;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x56E2;&#x961F;&#x7684;&#x6838;&#x5FC3;&#x3002;1983&#x5E74;&#xFF0C;&#x4ED6;&#x4EEC;&#x540C;&#x65F6;&#x83B7;&#x5F97;&#x4E86;ACM&#x56FE;&#x7075;&#x5956;&#x3002;<a href="#reffn_5" title="Jump back to footnote [5] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_6">
<sup>6</sup>. Donald E.Knuth&#xFF08;1938&#x2013;&#xFF09;&#xFF0C;&#x65AF;&#x5766;&#x798F;&#x5927;&#x5B66;&#x540D;&#x8A89;&#x6559;&#x6388;&#xFF0C;&#x7B97;&#x6CD5;&#x8BBE;&#x8BA1;&#x548C;&#x5206;&#x6790;&#x9886;&#x57DF;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4EBA;&#x7269;&#x4E4B;&#x4E00;&#xFF0C;&#x4E5F;&#x662F;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;TEX&#x6392;&#x7248;&#x7CFB;&#x7EDF;&#xFF08;&#x672C;&#x4E66;&#x5C31;&#x662F;&#x7528;&#x5B83;&#x5236;&#x4F5C;&#x7684;&#xFF09;&#x548C;TEX&#x6587;&#x672C;&#x7F16;&#x7A0B;&#x7684;&#x53D1;&#x660E;&#x8005;&#x3002;&#x4ED6;&#x7684;&#x591A;&#x5377;&#x4E66;&#x300A;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7684;&#x827A;&#x672F;&#x300B;&#x5728;&#x5927;&#x591A;&#x6570;&#x4E13;&#x4E1A;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;&#x4E4B;&#x95F4;&#x4EAB;&#x6709;&#x5F88;&#x9AD8;&#x7684;&#x58F0;&#x8A89;&#x3002;&#x4ED6;&#x5728;1974&#x5E74;&#x83B7;&#x5F97;ACM&#x56FE;&#x7075;&#x5956;&#x3002;<a href="#reffn_6" title="Jump back to footnote [6] in the text."> &#x21A9;</a>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 第1章 绪论">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1-2.html" class="navigation navigation-next " aria-label="Next page: 1.2 程序设计语言族谱">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.1 程序设计语言设计的艺术","level":"1.4.1.1","depth":3,"next":{"title":"1.2 程序设计语言族谱","level":"1.4.1.2","depth":3,"path":"part1/ch1/1-2.md","ref":"part1/ch1/1-2.md","articles":[]},"previous":{"title":"第1章 绪论","level":"1.4.1","depth":2,"path":"part1/ch1/README.md","ref":"part1/ch1/README.md","articles":[{"title":"1.1 程序设计语言设计的艺术","level":"1.4.1.1","depth":3,"path":"part1/ch1/1-1.md","ref":"part1/ch1/1-1.md","articles":[]},{"title":"1.2 程序设计语言族谱","level":"1.4.1.2","depth":3,"path":"part1/ch1/1-2.md","ref":"part1/ch1/1-2.md","articles":[]},{"title":"1.3 为什么学习程序设计语言","level":"1.4.1.3","depth":3,"path":"part1/ch1/1-3.md","ref":"part1/ch1/1-3.md","articles":[]},{"title":"1.4 编译器和解释器","level":"1.4.1.4","depth":3,"path":"part1/ch1/1-4.md","ref":"part1/ch1/1-4.md","articles":[]},{"title":"1.5 编程环境","level":"1.4.1.5","depth":3,"path":"part1/ch1/1-5.md","ref":"part1/ch1/1-5.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"descrption":"Programming Language Pragmatics Fourth Edtion 中文版","theme":"default","author":"Michael L. Scott","margin":{"right":30,"left":30,"top":30,"bottom":50},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"978-0-12-410409-9","variables":{},"title":"程序设计语言 实践之路（第四版）","language":"zh-hans","gitbook":"*","direction":"ltr"},"file":{"path":"part1/ch1/1-1.md","mtime":"2022-06-27T15:41:12.095Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-06-27T15:41:17.520Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

