
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.3 为什么学习程序设计语言 · 程序设计语言 实践之路（第四版）</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Michael L. Scott">
        <meta name="identifier" content="978-0-12-410409-9" scheme="ISBN">
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1-4.html" />
    
    
    <link rel="prev" href="1-2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../foreword.html">
            
                <a href="../../foreword.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../../preface.html">
            
                <a href="../../preface.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../">
            
                <a href="../">
            
                    
                    第1部分 基础
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="./">
            
                <a href="./">
            
                    
                    第1章 绪论
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1.1" data-path="1-1.html">
            
                <a href="1-1.html">
            
                    
                    1.1 程序设计语言设计的艺术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.2" data-path="1-2.html">
            
                <a href="1-2.html">
            
                    
                    1.2 程序设计语言族谱
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.1.3" data-path="1-3.html">
            
                <a href="1-3.html">
            
                    
                    1.3 为什么学习程序设计语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.4" data-path="1-4.html">
            
                <a href="1-4.html">
            
                    
                    1.4 编译器和解释器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.5" data-path="1-5.html">
            
                <a href="1-5.html">
            
                    
                    1.5 编程环境
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >1.3 为什么学习程序设计语言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="13-&#x4E3A;&#x4EC0;&#x4E48;&#x5B66;&#x4E60;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;">1.3 &#x4E3A;&#x4EC0;&#x4E48;&#x5B66;&#x4E60;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;</h1>
<p>&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x53CA;&#x5176;&#x8BFE;&#x7A0B;&#x7684;&#x6838;&#x5FC3;&#x3002;&#x50CF;&#x5927;&#x591A;&#x6570;&#x8F66;&#x4E3B;&#x4E00;&#x6837;&#xFF0C;&#x719F;&#x6089;&#x4E00;&#x79CD;&#x6216;&#x591A;&#x79CD;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x7684;&#x5B66;&#x751F;&#x901A;&#x5E38;&#x5BF9;&#x5B66;&#x4E60;&#x5176;&#x5B83;&#x8BED;&#x8A00;&#x5F88;&#x597D;&#x5947;&#xFF0C;&#x60F3;&#x77E5;&#x9053;&#x201C;&#x5F15;&#x64CE;&#x76D6;&#x4E0B;&#x201D;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x5B66;&#x4E60;&#x8BED;&#x8A00;&#x5F88;&#x6709;&#x8DA3;&#xFF0C;&#x4E5F;&#x5F88;&#x5B9E;&#x7528;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x7406;&#x89E3;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x6709;&#x52A9;&#x4E8E;&#x4E3A;&#x7ED9;&#x5B9A;&#x4EFB;&#x52A1;&#x9009;&#x62E9;&#x6700;&#x5408;&#x9002;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x5728;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#x6BD4;&#x5176;&#x5B83;&#x65B9;&#x9762;&#x8981;&#x66F4;&#x597D;&#x3002;&#x5F88;&#x5C11;&#x6709;&#x7A0B;&#x5E8F;&#x5458;&#x4F1A;&#x9009;&#x62E9;Fortran&#x8FDB;&#x884C;&#x7B26;&#x53F7;&#x8BA1;&#x7B97;&#x6216;&#x5B57;&#x7B26;&#x4E32;&#x5904;&#x7406;&#xFF0C;&#x4F46;&#x5176;&#x5B83;&#x7684;&#x9009;&#x62E9;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x7684;&#x660E;&#x786E;&#xFF1A;&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#x5E94;&#x8BE5;&#x9009;&#x62E9;C&#x3001;C++&#x8FD8;&#x662F;C#&#xFF1F;&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x5E94;&#x8BE5;&#x9009;&#x62E9;Fortran&#x8FD8;&#x662F;C&#xFF1F;Web&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;PHP&#x8FD8;&#x662F;Ruby&#xFF1F;&#x5D4C;&#x5165;&#x5F0F;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;Ada&#x8FD8;&#x662F;C&#xFF1F;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x4F7F;&#x7528;Visual Basic&#x8FD8;&#x662F;Java&#xFF1F;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x5E94;&#x8BE5;&#x80FD;&#x5E2E;&#x52A9;&#x4F60;&#x505A;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x540C;&#x6837;&#xFF0C;&#x672C;&#x4E66;&#x4E5F;&#x4F1A;&#x8BA9;&#x5B66;&#x4E60;&#x65B0;&#x8BED;&#x8A00;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x3002;&#x8BED;&#x8A00;&#x4E4B;&#x95F4;&#x90FD;&#x662F;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;C++&#xFF0C;&#x90A3;&#x4E48;&#x5B66;&#x4E60;Java&#x548C;C#&#x4F1A;&#x66F4;&#x5BB9;&#x6613;&#xFF1B;&#x5982;&#x679C;&#x4F60;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;Scheme&#xFF0C;&#x90A3;&#x4E48;&#x5B66;&#x4E60;&#x901A;&#x8FC7;Lisp&#x4F1A;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#xFF1B;&#x5982;&#x679C;&#x4F60;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;ML&#xFF0C;&#x5B66;&#x4E60;Haskell&#x4F1A;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x5176;&#x4E2D;&#x5927;&#x591A;&#x6570;&#x6982;&#x5FF5;&#x90FD;&#x662F;&#x672C;&#x4E66;&#x5404;&#x7AE0;&#x7684;&#x4E3B;&#x9898;&#xFF1A;&#x7C7B;&#x578B;&#x3001;&#x63A7;&#x5236;&#xFF08;&#x8FED;&#x4EE3;&#x3001;&#x9009;&#x62E9;&#x3001;&#x9012;&#x5F52;&#x3001;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x3001;&#x5E76;&#x53D1;&#xFF09;&#x3001;&#x62BD;&#x8C61;&#x548C;&#x547D;&#x540D;&#x3002;&#x4E0E;&#x76F4;&#x63A5;&#x5B66;&#x4E60;&#x76F8;&#x6BD4;&#xFF0C;&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x8FDB;&#x884C;&#x601D;&#x8003;&#x66F4;&#x5BB9;&#x6613;&#x638C;&#x63E1;&#x65B0;&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x6CD5;&#xFF08;&#x5F62;&#x5F0F;&#xFF09;&#x548C;&#x8BED;&#x4E49;&#xFF08;&#x610F;&#x4E49;&#xFF09;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x60C5;&#x51B5;&#x548C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#xFF1A;&#x638C;&#x63E1;&#x8BED;&#x6CD5;&#x6709;&#x52A9;&#x4E8E;&#x5B66;&#x4E60;&#x5916;&#x8BED;&#x3002;</p>
<p>&#x65E0;&#x8BBA;&#x5B66;&#x4E60;&#x4EC0;&#x4E48;&#x8BED;&#x8A00;&#xFF0C;&#x7406;&#x89E3;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x51B3;&#x7B56;&#x90FD;&#x5C06;&#x5E2E;&#x52A9;&#x4F60;&#x66F4;&#x597D;&#x5730;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x672C;&#x4E66;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#xFF1A;</p>
<ul>
<li><p><em>&#x7406;&#x89E3;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x6A21;&#x7CCA;&#x7279;&#x6027;</em>&#x3002;&#x5F88;&#x5C11;&#x6709;C++&#x7A0B;&#x5E8F;&#x5458;&#x4F7F;&#x7528;&#x8054;&#x5408;&#x3001;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x3001;&#x53EF;&#x53D8;&#x53C2;&#x6570;&#x6216;&#x8005;<code>.*</code>&#x8FD0;&#x7B97;&#xFF08;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4E5F;&#x522B;&#x62C5;&#x5FC3;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x53EA;&#x662F;&#x7B80;&#x5316;&#x4E86;&#x8BED;&#x8A00;&#x3002;&#x5F53;&#x5728;&#x624B;&#x518C;&#x4E2D;&#x67E5;&#x627E;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x65F6;&#xFF0C;&#x7406;&#x89E3;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x6709;&#x52A9;&#x4E8E;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x3002;</p>
</li>
<li><p><em>&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;</em>&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x57FA;&#x4E8E;&#x5BF9;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x7684;&#x7406;&#x89E3;&#x3002;&#x4F8B;&#x5982;&#x5728;C++&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x9700;&#x8981;&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#xFF0C;&#x5E76;&#x5C3D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6765;&#x51CF;&#x5C11;&#x521D;&#x59CB;&#x5316;&#x7684;&#x6210;&#x672C;&#xFF1B;&#x5728;Java&#x4E2D;&#xFF0C;&#x4ED6;&#x4EEC;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;Executor&#x5BF9;&#x8C61;&#x800C;&#x4E0D;&#x662F;&#x663E;&#x5F0F;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x3002;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#xFF08;&#x8F83;&#x5DEE;&#x7684;&#xFF09;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x7684;&#x7F16;&#x7A0B;&#x4E60;&#x60EF;&#x6765;&#x83B7;&#x5F97;&#x6700;&#x5FEB;&#x7684;&#x4EE3;&#x7801;&#xFF1A;&#x4F7F;&#x7528;&#x6307;&#x9488;&#x6570;&#x7EC4;&#x904D;&#x5386;&#xFF1B;<code>x*x</code>&#x800C;&#x4E0D;&#x662F;<code>x**2</code>&#x3002;&#x5728;&#x4EFB;&#x4F55;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x9700;&#x8981;&#x6839;&#x636E;&#x62BD;&#x8C61;&#x80CC;&#x540E;&#x7684;&#x5E95;&#x5C42;&#x5B9E;&#x73B0;&#x8FDB;&#x884C;&#x6743;&#x8861;&#x2014;&#x2014;&#x4F8B;&#x5982;&#x662F;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD8;&#x662F;&#x901A;&#x8FC7;&#x67E5;&#x627E;&#x6765;&#x83B7;&#x5F97;&#x4F4D;&#x96C6;&#x5408;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
</li>
<li><p><em>&#x66F4;&#x597D;&#x7684;&#x5229;&#x7528;&#x8C03;&#x8BD5;&#x5668;&#x3001;&#x6C47;&#x7F16;&#x5668;&#x3001;&#x94FE;&#x63A5;&#x5668;&#x548C;&#x76F8;&#x5173;&#x5DE5;&#x5177;</em>&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x4F7F;&#x7528;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x4E0D;&#x8FC7;&#x6709;&#x65F6;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x51E0;&#x4E4E;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x613F;&#x610F;&#x7AA5;&#x63A2;&#x5176;&#x4E2D;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x90A3;&#x4E48;&#x5947;&#x602A;&#x7684;bug&#x6216;&#x7CFB;&#x7EDF;&#x6784;&#x5EFA;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x4F1A;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5904;&#x7406;&#x3002;</p>
</li>
<li><p><em>&#x6A21;&#x62DF;&#x8BED;&#x8A00;&#x4E0D;&#x652F;&#x6301;&#x7684;&#x529F;&#x80FD;</em>&#x3002;&#x65E7;&#x8BED;&#x8A00;&#x4E2D;&#x7F3A;&#x5C11;&#x67D0;&#x4E9B;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9075;&#x5FAA;&#x4E00;&#x79CD;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x6765;&#x6A21;&#x62DF;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x3002;&#x4F8B;&#x5982;&#x5728;&#x65E7;&#x7684;Fortran&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x719F;&#x6089;&#x73B0;&#x4EE3;&#x63A7;&#x5236;&#x7ED3;&#x6784;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6CE8;&#x91CA;&#x548C;&#x826F;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x6765;&#x7F16;&#x5199;&#x7ED3;&#x6784;&#x826F;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5728;&#x62BD;&#x8C61;&#x80FD;&#x529B;&#x8F83;&#x5DEE;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6CE8;&#x91CA;&#x548C;&#x547D;&#x540D;&#x6709;&#x52A9;&#x4E8E;&#x5B9E;&#x73B0;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x800C;Clu&#x3001;C#&#x3001;Python&#x548C;Ruby&#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x5728;6.5.3&#x8282;&#x4E2D;&#x7814;&#x7A76;&#xFF09;&#x4E2D;&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x53EF;&#x4EE5;&#x7528;&#x5B50;&#x7A0B;&#x5E8F;&#x548C;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x6765;&#x6A21;&#x62DF;&#x3002;</p>
</li>
<li><p><em>&#x66F4;&#x597D;&#x5730;&#x5229;&#x7528;&#x8BED;&#x8A00;&#x6280;&#x672F;</em>&#x3002;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x4E0D;&#x4F1A;&#x8BBE;&#x8BA1;&#x6216;&#x5B9E;&#x73B0;&#x4F20;&#x7EDF;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x9700;&#x8981;&#x8BED;&#x8A00;&#x6280;&#x672F;&#x6765;&#x5B8C;&#x6210;&#x5176;&#x5B83;&#x7F16;&#x7A0B;&#x4EFB;&#x52A1;&#x3002;&#x4E2A;&#x4EBA;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x5305;&#x542B;&#x51E0;&#x5341;&#x79CD;&#x7ED3;&#x6784;&#x5316;&#x683C;&#x5F0F;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5305;&#x62EC;&#x6587;&#x5B57;&#x5904;&#x7406;&#x3001;&#x7535;&#x5B50;&#x8868;&#x683C;&#x3001;&#x6F14;&#x793A;&#x6587;&#x7A3F;&#x3001;&#x5149;&#x6805;&#x548C;&#x77E2;&#x91CF;&#x56FE;&#x5F62;&#x3001;&#x97F3;&#x4E50;&#x3001;&#x89C6;&#x9891;&#x3001;&#x6570;&#x636E;&#x5E93;&#x4EE5;&#x53CA;&#x5404;&#x79CD;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x3002;Web&#x5185;&#x5BB9;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x5730;&#x7528;XML&#x8868;&#x793A;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x6587;&#x672C;&#x7684;&#x683C;&#x5F0F;&#xFF0C;XSLT&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF08;&#x5728;14.3.5&#x8282;&#x4E2D;&#x8BA8;&#x8BBA;&#xFF09;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x5904;&#x7406;&#x5B83;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x51E0;&#x4E4E;&#x5728;&#x4EFB;&#x4F55;&#x590D;&#x6742;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x89E3;&#x6790;&#x3001;&#x5206;&#x6790;&#x3001;&#x751F;&#x6210;&#x3001;&#x4F18;&#x5316;&#x7B49;&#x64CD;&#x4F5C;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x90FD;&#x57FA;&#x4E8E;&#x8BED;&#x8A00;&#x6280;&#x672F;&#x3002;&#x638C;&#x63E1;&#x8FD9;&#x9879;&#x6280;&#x672F;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5C06;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x5730;&#x7F16;&#x5199;&#x7ED3;&#x6784;&#x826F;&#x597D;&#x3001;&#x53EF;&#x7EF4;&#x62A4;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<p>  &#x5927;&#x591A;&#x6570;&#x5DE5;&#x5177;&#x672C;&#x8EAB;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x542F;&#x52A8;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3001;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x3001;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#x6216;&#x5185;&#x7F6E;&#x6269;&#x5C55;&#x8BED;&#x8A00;&#xFF08;&#x7B2C;14&#x7AE0;&#x5C06;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#xFF09;&#x8FDB;&#x884C;&#x5B9A;&#x5236;&#x3002;&#x6211;&#x7684;<code>home</code>&#x76EE;&#x5F55;&#x5305;&#x542B;250&#x591A;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x5176;&#x4E2D;emacs&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x4E2A;&#x4EBA;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5305;&#x542B;1200&#x591A;&#x884C;Lisp&#x4EE3;&#x7801;&#x3002;&#x5982;&#x4ECA;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x590D;&#x6742;&#x7A0B;&#x5E8F;&#x90FD;&#x9700;&#x8981;&#x652F;&#x6301;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6216;&#x6269;&#x5C55;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x8981;&#x4E48;&#x91C7;&#x7528;&#xFF08;&#x6216;&#x9002;&#x914D;&#xFF09;&#x4E00;&#x4E9B;&#x73B0;&#x6709;&#x7684;&#x6269;&#x5C55;&#x8BED;&#x8A00;&#xFF0C;&#x8981;&#x4E48;&#x53D1;&#x660E;&#x81EA;&#x5DF1;&#x7684;&#x65B0;&#x8BED;&#x8A00;&#x3002;&#x7CBE;&#x901A;&#x8BED;&#x8A00;&#x7406;&#x8BBA;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5C06;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x5730;&#x8BBE;&#x8BA1;&#x51FA;&#x4F18;&#x96C5;&#x3001;&#x7ED3;&#x6784;&#x826F;&#x597D;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5728;&#x6EE1;&#x8DB3;&#x5F53;&#x524D;&#x7528;&#x6237;&#x9700;&#x6C42;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E5F;&#x6709;&#x52A9;&#x4E8E;&#x540E;&#x7EED;&#x5F00;&#x53D1;&#x3002;</p>
</li>
</ul>
<p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x8BED;&#x8A00;&#x7684;&#x503E;&#x5411;&#xFF0C;&#x672C;&#x4E66;&#x53EF;&#x4EE5;&#x4E3A;&#x4F60;&#x8FDB;&#x4E00;&#x6B65;&#x5B66;&#x4E60;&#x505A;&#x51C6;&#x5907;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x8FD9;&#x4E9B;&#x9886;&#x57DF;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x5B83;&#x8FD8;&#x5C06;&#x5E2E;&#x52A9;&#x4F60;&#x7406;&#x89E3;&#x8BED;&#x8A00;&#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1-2.html" class="navigation navigation-prev " aria-label="Previous page: 1.2 程序设计语言族谱">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1-4.html" class="navigation navigation-next " aria-label="Next page: 1.4 编译器和解释器">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.3 为什么学习程序设计语言","level":"1.4.1.3","depth":3,"next":{"title":"1.4 编译器和解释器","level":"1.4.1.4","depth":3,"path":"part1/ch1/1-4.md","ref":"part1/ch1/1-4.md","articles":[]},"previous":{"title":"1.2 程序设计语言族谱","level":"1.4.1.2","depth":3,"path":"part1/ch1/1-2.md","ref":"part1/ch1/1-2.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"descrption":"Programming Language Pragmatics Fourth Edtion 中文版","theme":"default","author":"Michael L. Scott","margin":{"right":30,"left":30,"top":30,"bottom":50},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"978-0-12-410409-9","variables":{},"title":"程序设计语言 实践之路（第四版）","language":"zh-hans","gitbook":"*","direction":"ltr"},"file":{"path":"part1/ch1/1-3.md","mtime":"2022-06-27T15:41:12.095Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-06-27T15:41:17.520Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

