
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第1章 绪论 · 程序设计语言 实践之路（第四版）</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Michael L. Scott">
        <meta name="identifier" content="978-0-12-410409-9" scheme="ISBN">
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1-1.html" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../foreword.html">
            
                <a href="../../foreword.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../../preface.html">
            
                <a href="../../preface.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../">
            
                <a href="../">
            
                    
                    第1部分 基础
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.4.1" data-path="./">
            
                <a href="./">
            
                    
                    第1章 绪论
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1.1" data-path="1-1.html">
            
                <a href="1-1.html">
            
                    
                    1.1 程序设计语言设计的艺术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.2" data-path="1-2.html">
            
                <a href="1-2.html">
            
                    
                    1.2 程序设计语言族谱
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.3" data-path="1-3.html">
            
                <a href="1-3.html">
            
                    
                    1.3 为什么学习程序设计语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.4" data-path="1-4.html">
            
                <a href="1-4.html">
            
                    
                    1.4 编译器和解释器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.1.5" data-path="1-5.html">
            
                <a href="1-5.html">
            
                    
                    1.5 编程环境
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >第1章 绪论</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;1&#x7AE0;-&#x7EEA;&#x8BBA;">&#x7B2C;1&#x7AE0; &#x7EEA;&#x8BBA;</h1>
<p>&#x65E9;&#x671F;&#x7684;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x662F;&#x5DE8;&#x5927;&#x7684;&#x88C5;&#x7F6E;&#xFF0C;&#x9700;&#x8981;&#x5360;&#x636E;&#x597D;&#x51E0;&#x4E2A;&#x623F;&#x95F4;&#xFF0C;&#x8017;&#x7535;&#x91CF;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x5DE5;&#x5382;&#xFF0C;&#x9020;&#x4EF7;&#x6570;&#x767E;&#x4E07;&#x7F8E;&#x5143;&#xFF08;&#x4F46;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x751A;&#x81F3;&#x6BD4;&#x73B0;&#x4EE3;&#x6700;&#x7B80;&#x5355;&#x7684;&#x624B;&#x673A;&#x90FD;&#x8981;&#x4F4E;&#xFF09;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x673A;&#x5668;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x8BA4;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x65F6;&#x95F4;&#x6BD4;&#x4ED6;&#x4EEC;&#x7684;&#x65F6;&#x95F4;&#x66F4;&#x6709;&#x4EF7;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x7528;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#x3002;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x662F;&#x76F4;&#x63A5;&#x63A7;&#x5236;&#x5904;&#x7406;&#x5668;&#x7684;&#x4F4D;&#x5E8F;&#x5217;&#xFF0C;&#x4F7F;&#x5176;&#x5728;&#x9002;&#x5F53;&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;&#x52A0;&#x6CD5;&#x548C;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#xFF0C;&#x5E76;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x79FB;&#x52A8;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x7EA7;&#x522B;&#x4E0A;&#x8FDB;&#x884C;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x662F;&#x4E00;&#x9879;&#x6781;&#x5176;&#x4E4F;&#x5473;&#x7684;&#x4EFB;&#x52A1;&#x3002;(EXAMPLE 1.1 GCD program in x86 machine language)&#x4E0B;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x6B27;&#x51E0;&#x91CC;&#x5FB7;&#x7B97;&#x6CD5;&#x8BA1;&#x7B97;&#x4E24;&#x4E2A;&#x6574;&#x6570;&#x7684;&#x6700;&#x5927;&#x516C;&#x56E0;&#x6570;&#xFF0C;&#x5B83;&#x662F;&#x7528;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x8868;&#x793A;&#x4E3A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#xFF08;&#x4EE5;16&#x4E3A;&#x57FA;&#x6570;&#xFF09;&#xFF0C;&#x7528;&#x4E8E;x86&#x6307;&#x4EE4;&#x96C6;&#x3002;</p>
<pre><code class="lang-hex">55 89 e5 53 83 ec 04 83 e4 f0 e8 31 00 00 00 89 c3 e8 2a 00
00 00 39 c3 74 10 8d b6 00 00 00 00 39 c3 7e 13 29 c3 39 c3
75 f6 89 1c 24 e8 6e 00 00 00 8b 5d fc c9 c3 29 d8 eb eb 90
</code></pre>
<p>&#x968F;&#x7740;&#x4EBA;&#x4EEC;&#x5F00;&#x59CB;&#x7F16;&#x5199;&#x5927;&#x578B;&#x7A0B;&#x5E8F;&#xFF0C;&#x4ED6;&#x4EEC;&#x610F;&#x8BC6;&#x5230;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x4E0D;&#x6613;&#x51FA;&#x9519;&#x7684;&#x7A0B;&#x5E8F;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#x3002;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x79CD;&#x901A;&#x8FC7;&#x52A9;&#x8BB0;&#x7B26;&#x7684;&#x65B9;&#x5F0F;&#x8868;&#x8FBE;&#x64CD;&#x4F5C;&#x7684;&#x8BED;&#x8A00;&#x3002;(EXAMPLE 1.2 GCD program in x86 assembler)&#x4E0A;&#x9762;&#x7684;&#x6700;&#x5927;&#x516C;&#x56E0;&#x6570;&#x7A0B;&#x5E8F;&#x7684;x86&#x6C47;&#x7F16;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#x4E3A;&#xFF1A;</p>
<pre><code class="lang-x86">    pushl %ebp
    movl %esp, %ebp
    pushl %ebx
    subl $4, %esp
    andl $-16, %esp
    call getint
    movl %eax, %ebx
    call getint
    cmpl %eax, %ebx
    je C
A:  cmpl %eax, %ebx
    jle D
    subl %eax, %ebx
    B: cmpl %eax, %ebx
    jne A
C:  movl %ebx, (%esp)
    call putint
    movl -4(%ebp), %ebx
    leave
    ret
D:  subl %ebx, %eax
    jmp B
</code></pre>
<p>&#x6700;&#x521D;&#x8BBE;&#x8BA1;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x65F6;&#xFF0C;&#x52A9;&#x8BB0;&#x7B26;&#x548C;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x6307;&#x4EE4;&#x4E4B;&#x95F4;&#x662F;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5982;EXAMPLE 1.2&#x6240;&#x793A;<sup><a href="#fn_1" id="reffn_1">1</a></sup>&#x3002;&#x5C06;&#x52A9;&#x8BB0;&#x7B26;&#x7FFB;&#x4E3A;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x7684;&#x7CFB;&#x7EDF;&#x7A0B;&#x5E8F;&#x79F0;&#x4E3A;&#x6C47;&#x7F16;&#x5668;&#x3002;&#x540E;&#x6765;&#xFF0C;&#x6C47;&#x7F16;&#x5668;&#x5F00;&#x59CB;&#x652F;&#x6301;&#x201C;&#x5B8F;&#x5C55;&#x5F00;&#x201D;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x4E3A;&#x5E38;&#x7528;&#x7684;&#x6307;&#x4EE4;&#x5E8F;&#x5217;&#x5B9A;&#x4E49;&#x53C2;&#x6570;&#x5316;&#x5F62;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x548C;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x4E4B;&#x95F4;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x4ECD;&#x7136;&#x662F;&#x660E;&#x786E;&#x7684;&#x3002;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x4EE5;&#x9762;&#x5411;&#x673A;&#x5668;&#x7684;&#x5DE5;&#x4F5C;&#xFF1A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4F7F;&#x7528;&#x5176;&#x6240;&#x652F;&#x6301;&#x7684;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x7F16;&#x7A0B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x6309;&#x7167;&#x673A;&#x5668;&#x5B9E;&#x9645;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x601D;&#x8003;&#x3002;</p>
<p>&#x968F;&#x7740;&#x8BA1;&#x7B97;&#x673A;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4EBA;&#x4EEC;&#x610F;&#x8BC6;&#x5230;&#x4E3A;&#x6BCF;&#x53F0;&#x65B0;&#x673A;&#x5668;&#x91CD;&#x65B0;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x662F;&#x4E00;&#x4EF6;&#x4EE4;&#x4EBA;&#x6CAE;&#x4E27;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x800C;&#x4E14;&#x8DDF;&#x8E2A;&#x5927;&#x578B;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x7684;&#x7EC6;&#x8282;&#x4E5F;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x56F0;&#x96BE;&#x3002;&#x4EBA;&#x4EEC;&#x5F00;&#x59CB;&#x5BFB;&#x6C42;&#x4E00;&#x79CD;&#x72EC;&#x7ACB;&#x4E8E;&#x673A;&#x5668;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x8BE5;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x7528;&#x66F4;&#x63A5;&#x8FD1;&#x6570;&#x5B66;&#x516C;&#x5F0F;&#x7684;&#x5F62;&#x5F0F;&#x6765;&#x8868;&#x8FBE;&#x6570;&#x503C;&#x8BA1;&#x7B97;&#xFF08;&#x8FD9;&#x662F;&#x5F53;&#x65F6;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x7A0B;&#x5E8F;&#x7C7B;&#x578B;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x8BC9;&#x6C42;&#x4F7F;&#x5F97;&#x4EBA;&#x4EEC;&#x5728;20&#x4E16;&#x7EAA;50&#x5E74;&#x4EE3;&#x4E2D;&#x671F;&#x53D1;&#x660E;&#x4E86;Fortran&#xFF0C;&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x79F0;&#x5F97;&#x4E0A;&#x662F;&#x9AD8;&#x7EA7;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x539F;&#x59CB;&#x65B9;&#x8A00;&#x3002;&#x6B64;&#x540E;&#x5176;&#x5B83;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x4E5F;&#x5F88;&#x5FEB;&#x8DDF;&#x8FDB;&#xFF0C;&#x5C24;&#x5176;&#x662F;Lisp&#x548C;Algol&#x3002;</p>
<p>&#x5C06;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x8F6C;&#x6362;&#x4E3A;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x6216;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x7CFB;&#x7EDF;&#x7A0B;&#x5E8F;&#x7684;&#x5DE5;&#x4F5C;<sup><a href="#fn_2" id="reffn_2">2</a></sup>&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x8981;&#x6BD4;&#x6C47;&#x7F16;&#x5668;&#x590D;&#x6742;&#x5F97;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x6E90;&#x4EE3;&#x7801;&#x662F;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x65F6;&#xFF0C;&#x6E90;&#x4EE3;&#x7801;&#x548C;&#x76EE;&#x6807;&#x4EE3;&#x7801;&#x4E4B;&#x95F4;&#x4E0D;&#x518D;&#x5B58;&#x5728;&#x4E00;&#x5BF9;&#x4E00;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x3002;Fortran&#x4E00;&#x5F00;&#x59CB;&#x666E;&#x53CA;&#x7684;&#x5F88;&#x6162;&#xFF0C;&#x56E0;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#x51E0;&#x4E4E;&#x603B;&#x80FD;&#x7F16;&#x5199;&#x51FA;&#x6BD4;&#x7F16;&#x8BD1;&#x5668;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#x7684;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x7A0B;&#x5E8F;&#x3002;&#x7136;&#x800C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x8FD9;&#x79CD;&#x5DEE;&#x8DDD;&#x6162;&#x6162;&#x7F29;&#x5C0F;&#xFF0C;&#x5E76;&#x6700;&#x7EC8;&#x53CD;&#x8FC7;&#x6765;&#x4E86;&#x3002;&#x786C;&#x4EF6;&#x590D;&#x6742;&#x6027;&#x7684;&#x589E;&#x52A0;&#xFF08;&#x4F8B;&#x5982;&#x6D41;&#x6C34;&#x7EBF;&#x548C;&#x591A;&#x529F;&#x80FD;&#x5355;&#x5143;&#x7B49;&#xFF09;&#x548C;&#x7F16;&#x8BD1;&#x5668;&#x6280;&#x672F;&#x7684;&#x4E0D;&#x65AD;&#x6539;&#x8FDB;&#x5BFC;&#x81F4;&#x4E86;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5373;&#x6700;&#x5148;&#x8FDB;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x901A;&#x5E38;&#x4F1A;&#x751F;&#x6210;&#x6BD4;&#x7A0B;&#x5E8F;&#x5458;&#x7F16;&#x5199;&#x7684;&#x66F4;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5373;&#x4F7F;&#x5728;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x505A;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x901F;&#x5EA6;&#x7684;&#x63D0;&#x5347;&#x548C;&#x7A0B;&#x5E8F;&#x89C4;&#x6A21;&#x7684;&#x589E;&#x5927;&#x4E5F;&#x4F7F;&#x5F97;&#x964D;&#x4F4E;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x6210;&#x672C;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#x2014;&#x2014;&#x4E0D;&#x4EC5;&#x662F;&#x5728;&#x6700;&#x521D;&#x7684;&#x7A0B;&#x5E8F;&#x7F16;&#x5199;&#x4E2D;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x968F;&#x540E;&#x7684;&#x7A0B;&#x5E8F;&#x7EF4;&#x62A4;&#x3001;&#x589E;&#x5F3A;&#x548C;&#x4FEE;&#x590D;&#x4E2D;&#x3002;&#x52B3;&#x52A8;&#x529B;&#x6210;&#x672C;&#x73B0;&#x5728;&#x5927;&#x5927;&#x8D85;&#x8FC7;&#x4E86;&#x8BA1;&#x7B97;&#x786C;&#x4EF6;&#x7684;&#x6210;&#x672C;&#x3002;</p>
<blockquote id="fn_1">
<sup>1</sup>. &#x672C;&#x4F8B;&#x4E2D;&#x7684;22&#x884C;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x5728;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x4E2D;&#x662F;&#x53D8;&#x957F;&#x7F16;&#x7801;&#x7684;&#x3002;&#x4F8B;&#x5982;&#x4E09;&#x6761;cmp&#x6307;&#x4EE4;&#x6709;&#x7740;&#x76F8;&#x540C;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x7F16;&#x7801;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x4E3A;&#x4E24;&#x5B57;&#x8282;&#xFF08;39 c3&#xFF09;&#x3002;&#x56DB;&#x6761;mov&#x6307;&#x4EE4;&#x6709;&#x7740;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#x4EE5;89&#x6216;8b&#x5F00;&#x5934;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x662F;GNU gcc&#x7F16;&#x8BD1;&#x5668;&#x8BED;&#x6CD5;&#xFF0C;&#x7ED3;&#x679C;&#x5199;&#x5165;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#x3002;<a href="#reffn_1" title="Jump back to footnote [1] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_2">
<sup>2</sup>. &#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x4E5F;&#x53EF;&#x4EE5;&#x65E0;&#x9700;&#x7FFB;&#x8BD1;&#x76F4;&#x63A5;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="1-4.html">1.4</a>&#x8282;&#x4E2D;&#x8BA8;&#x8BBA;&#x6B64;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x662F;Python&#x548C;JavaScript&#x7B49;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x7684;&#x4E3B;&#x8981;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;<a href="#reffn_2" title="Jump back to footnote [2] in the text."> &#x21A9;</a>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: 第1部分 基础">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1-1.html" class="navigation navigation-next " aria-label="Next page: 1.1 程序设计语言设计的艺术">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第1章 绪论","level":"1.4.1","depth":2,"next":{"title":"1.1 程序设计语言设计的艺术","level":"1.4.1.1","depth":3,"path":"part1/ch1/1-1.md","ref":"part1/ch1/1-1.md","articles":[]},"previous":{"title":"第1部分 基础","level":"1.4","depth":1,"path":"part1/README.md","ref":"part1/README.md","articles":[{"title":"第1章 绪论","level":"1.4.1","depth":2,"path":"part1/ch1/README.md","ref":"part1/ch1/README.md","articles":[{"title":"1.1 程序设计语言设计的艺术","level":"1.4.1.1","depth":3,"path":"part1/ch1/1-1.md","ref":"part1/ch1/1-1.md","articles":[]},{"title":"1.2 程序设计语言族谱","level":"1.4.1.2","depth":3,"path":"part1/ch1/1-2.md","ref":"part1/ch1/1-2.md","articles":[]},{"title":"1.3 为什么学习程序设计语言","level":"1.4.1.3","depth":3,"path":"part1/ch1/1-3.md","ref":"part1/ch1/1-3.md","articles":[]},{"title":"1.4 编译器和解释器","level":"1.4.1.4","depth":3,"path":"part1/ch1/1-4.md","ref":"part1/ch1/1-4.md","articles":[]},{"title":"1.5 编程环境","level":"1.4.1.5","depth":3,"path":"part1/ch1/1-5.md","ref":"part1/ch1/1-5.md","articles":[]}]}]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"descrption":"Programming Language Pragmatics Fourth Edtion 中文版","theme":"default","author":"Michael L. Scott","margin":{"right":30,"left":30,"top":30,"bottom":50},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"978-0-12-410409-9","variables":{},"title":"程序设计语言 实践之路（第四版）","language":"zh-hans","gitbook":"*","direction":"ltr"},"file":{"path":"part1/ch1/README.md","mtime":"2022-06-27T15:41:12.095Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-06-27T15:41:17.520Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

